Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
#include "audio_capture.h"
#include "audio_capture_platform.h"
#include "ble_audio_stream.h"
#include "board_pins.h"
#include "denzic_audio_leveling_v1.h"
#include "listener_audio_proto.h"
#include "status_led.h"

#include <assert.h>
#include <inttypes.h>
#include <limits.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#ifdef CONFIG_AUDIO_CAPTURE_MIC_ES8311
#include "driver/i2c_master.h"
#endif

#include "driver/i2s_std.h"
#include "soc/soc_caps.h"
#include "esp_check.h"

#ifdef CONFIG_AUDIO_CAPTURE_MIC_ES8311
#include "esp_codec_dev.h"
#include "esp_codec_dev_defaults.h"
#endif

#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_random.h"
#include "esp_timer.h"
#include "diag_log.h"
#include "diag_log_events.h"
#include "watchdog_platform.h"
#include "freertos/idf_additions.h"

/* ---------- Shared defines ---------- */

#define AUDIO_CAPTURE_SAMPLE_RATE_HZ    (16000)
#define AUDIO_CAPTURE_FRAME_MS          (20)
#define AUDIO_CAPTURE_FRAME_SAMPLES     ((AUDIO_CAPTURE_SAMPLE_RATE_HZ * AUDIO_CAPTURE_FRAME_MS) / 1000)
#define AUDIO_CAPTURE_FRAME_BYTES       (AUDIO_CAPTURE_FRAME_SAMPLES * sizeof(int16_t))
#define AUDIO_CAPTURE_LOG_INTERVAL_FRAMES (500)
#define AUDIO_CAPTURE_TASK_STACK_BYTES  (6 * 1024)
#if CONFIG_FREERTOS_UNICORE
#define AUDIO_CAPTURE_TASK_CORE 0
#define AUDIO_CAPTURE_AFE_FETCH_TASK_CORE 0
#else
/*
 * ESP-SR's feed and fetch paths must run concurrently. VADNet makes the
 * fetch/DSP side substantially heavier than the old WebRTC-only pipeline, so
 * keeping both priority-5 tasks on CPU1 can fill the internal AFE ring and
 * strand feed inside the binary AFE call long enough to trip the Task WDT.
 * Keep the I2S/feed producer on CPU0 and fetch/DSP on CPU1, matching
 * Espressif's dual-core AFE task model. I2S blocks between 20 ms frames, so
 * NimBLE remains able to preempt the producer on CPU0.
 */
#define AUDIO_CAPTURE_TASK_CORE 0
#define AUDIO_CAPTURE_AFE_FETCH_TASK_CORE 1
#endif
#define AUDIO_CAPTURE_AFE_FETCH_TASK_PRIORITY 5
#define AUDIO_CAPTURE_V2_MIC_BLOCKER "V2 CLK/GPIO48 DOUT/GPIO47 microphone interface not validated"
/* Recording duration is user-controlled (KEY1 toggle); no fixed upper limit.
 * The only hard limit is uint16_t packet_sequence overflow in the BLE protocol,
 * which is handled gracefully by sending session_stop before overflow. */
#define AUDIO_CAPTURE_STREAM_BATCH_FRAMES 3
#define AUDIO_CAPTURE_STREAM_BATCH_BYTES (AUDIO_CAPTURE_STREAM_BATCH_FRAMES * AUDIO_CAPTURE_FRAME_BYTES)
#define AUDIO_CAPTURE_STREAM_PROGRESS_LOG_PACKET_INTERVAL 64U
#define AUDIO_CAPTURE_IDLE_POWER_SAVE_WAIT_MS 5000U
#define AUDIO_CAPTURE_OTA_SUSPEND_TIMEOUT_MS 250U
#define AUDIO_CAPTURE_I2S_READ_TIMEOUT_MS 250U
/* The audio tasks are watchdog-subscribed and run at priority 5.  A frame
 * counter is not a scheduler budget: I2S/AFE can return a variable number of
 * frames per tick, and an empty AFE result can make the fetch loop spin without
 * producing a frame at all.  Bound runnable time directly so both success and
 * error paths always give the core idle task a chance to feed its TWDT entry. */
#define AUDIO_CAPTURE_IDLE_BUDGET_US 20000LL
#define AUDIO_CAPTURE_PDM_HW_AMPLIFY_NUM 8U
/* ESP32-S3 does not expose SOC_I2S_SUPPORTS_PDM_RX_HP_FILTER, so the nominal
 * hardware amplify setting below is not applied on this board. Calibrate the
 * SPH0655 path before WebRTC NS: current V2.2 hardware otherwise delivers
 * physical speech at only 113..582 peak and NS irreversibly removes phonemes
 * before the downstream AGC can recover them. This is a board calibration
 * ceiling, not a second output AGC: the frame peak guard drops gain immediately
 * for close speech and restores it gradually without exceeding 16-bit headroom.
 * The post-NS AGC and final limiter still own output levelling. The V2.2 air
 * overlap bench later measured raw peaks of only 166..215 for strong Chinese
 * speech. An 8x ceiling still fed WebRTC NS at just 1160..1720 peak, where it
 * intermittently removed an entire speaker. A 32x ceiling lets weak speech
 * approach the existing 16000 target; the per-frame peak guard still drops
 * gain immediately for close speech, so this does not weaken headroom. */
#define AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_MAX_NUM 32U
/* A new wake candidate must not inherit a near-1x gain after a loud prior
 * session, but jumping straight to 32x makes the first pre-roll frame decide
 * the entire candidate gain before the owner's phrase arrives.  Keep the
 * calibrated gain across sessions and raise only its lower bound.  The
 * per-frame peak guard below still attacks immediately for a close/loud frame.
 */
#define AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_SESSION_FLOOR_NUM 8U
#define AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_Q8_ONE 256U
#define AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_TARGET_PEAK 16000U
#define AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_RECOVERY_Q8 64U
/* WebRTC AFE accepts 10 ms feed blocks. Starting a session can queue the complete
 * 2 s pre-roll; PSRAM owns that history and the fetch task drains it continuously
 * in bounded batches so the producer stays ahead without steady-state delay. */
#define AUDIO_CAPTURE_PDM_AFE_RINGBUF_FRAMES 24
#define AUDIO_CAPTURE_PDM_AFE_FETCH_WAIT_MS 100U
#define AUDIO_CAPTURE_PDM_AFE_IDLE_BUDGET_FETCHES 64U
#define AUDIO_CAPTURE_PDM_SESSION_WARMUP_MIN_FEED_BLOCKS 5U
#define AUDIO_CAPTURE_PDM_SESSION_WARMUP_TIMEOUT_MS 1200U
#define AUDIO_CAPTURE_PDM_VAD_MIN_SPEECH_MS 128
#define AUDIO_CAPTURE_PDM_VAD_MIN_NOISE_MS 128
#define AUDIO_CAPTURE_PDM_VAD_DELAY_MS 128
#define AUDIO_CAPTURE_PDM_AGC_FRAME_MS 10U
#define AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES \
    ((AUDIO_CAPTURE_SAMPLE_RATE_HZ * AUDIO_CAPTURE_PDM_AGC_FRAME_MS) / 1000U)
#define AUDIO_CAPTURE_PDM_AGC_COMPRESSION_DB 48
#define AUDIO_CAPTURE_PDM_AGC_TARGET_DBFS 6
#define AUDIO_CAPTURE_PDM_LIMITER_CEILING 23170
#define AUDIO_CAPTURE_PDM_LIMITER_Q15_ONE 32768U
#define AUDIO_CAPTURE_PDM_VAD_NOISE_INITIAL_MEAN_ABS 4U
#define AUDIO_CAPTURE_PDM_VAD_NOISE_MIN_MEAN_ABS 1U
#define AUDIO_CAPTURE_PDM_VAD_NOISE_EWMA_SHIFT 5U
#define AUDIO_CAPTURE_PDM_VAD_LOW_SNR_NUMERATOR 3U
#define AUDIO_CAPTURE_PDM_VAD_LOW_SNR_DENOMINATOR 2U
#define AUDIO_CAPTURE_PDM_VAD_LOW_SNR_MIN_MARGIN 3U
#define AUDIO_CAPTURE_VOICE_PREROLL_MAX_MS 2000U
#define AUDIO_CAPTURE_VOICE_PREROLL_FRAMES \
    (AUDIO_CAPTURE_VOICE_PREROLL_MAX_MS / AUDIO_CAPTURE_FRAME_MS)
#define AUDIO_CAPTURE_VOICE_PREROLL_BYTES \
    ((size_t)AUDIO_CAPTURE_VOICE_PREROLL_FRAMES * AUDIO_CAPTURE_FRAME_BYTES)
#if defined(CONFIG_AUDIO_CAPTURE_SPH0655_CLK_INVERT) && CONFIG_AUDIO_CAPTURE_SPH0655_CLK_INVERT
#define AUDIO_CAPTURE_SPH0655_CLK_INVERT_ENABLED 1
#else
#define AUDIO_CAPTURE_SPH0655_CLK_INVERT_ENABLED 0
#endif
// Status LED level is a raw-microphone visual envelope. Firmware capture now
// preserves 4x more microphone headroom than the former clipped path, so its
// display calibration must retain the corresponding raw-signal sensitivity
// without changing PCM. Never feed the post-AGC/limiter output back into this
// meter: levelled recording audio must not make every real input look full-scale.
// Keep the 40-unit silence floor; a 847-unit full scale is a 1.5x steeper
// visual-only response than the preceding 40-to-1250 calibration.
#define AUDIO_CAPTURE_LEVEL_NOISE_FLOOR 40U
#define AUDIO_CAPTURE_LEVEL_FULL_SCALE 847U

/* ---------- ES8311-specific defines ---------- */

#ifdef CONFIG_AUDIO_CAPTURE_MIC_ES8311
#define AUDIO_CAPTURE_I2C_PORT          (0)
#define AUDIO_CAPTURE_I2C_SDA_IO        (4)
#define AUDIO_CAPTURE_I2C_SCL_IO        (5)
#define AUDIO_CAPTURE_ES8311_I2S_PORT   (0)
#define AUDIO_CAPTURE_ES8311_I2S_MCLK_IO (GPIO_NUM_45)
#define AUDIO_CAPTURE_ES8311_I2S_BCLK_IO (GPIO_NUM_39)
#define AUDIO_CAPTURE_ES8311_I2S_WS_IO  (GPIO_NUM_41)
#define AUDIO_CAPTURE_ES8311_I2S_DIN_IO (GPIO_NUM_40)
#define AUDIO_CAPTURE_ES8311_I2S_DOUT_IO (GPIO_NUM_NC)
#define AUDIO_CAPTURE_MCLK_MULTIPLE     (384)
#define AUDIO_CAPTURE_INPUT_GAIN_DB     (42.0f)
#endif

/* ---------- SPH0655-specific defines ---------- */

#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
#include "driver/i2s_pdm.h"
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
#include "esp_afe_config.h"
#include "esp_afe_sr_iface.h"
#include "esp_afe_sr_models.h"
#include "esp_agc.h"
#include "model_path.h"
#endif
#endif

static const char *TAG = "audio_capture";

/* ---------- Types ---------- */

