Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
typedef enum {
    AUDIO_CAPTURE_EXPORT_MODE_NONE = 0,
    AUDIO_CAPTURE_EXPORT_MODE_SESSION,
} audio_capture_export_mode_t;

typedef struct {
    audio_capture_export_mode_t mode;
    bool requested;
    bool warmup_pending;
    bool active;
    bool ble_session_started;
    uint16_t start_origin;
    bool stop_requested;
    uint16_t stop_origin;
    bool cancel_requested;
    uint32_t duration_seconds;
    uint32_t total_frames;
    uint32_t captured_frames;
    size_t pcm_bytes_total;
    size_t pcm_bytes_written;
    uint32_t session_id;
    uint16_t stream_next_packet_sequence;
    uint16_t stream_batch_frame_count;
    uint8_t stream_batch_raw_input_level_percent;
    uint8_t stream_batch_buffer[AUDIO_CAPTURE_STREAM_BATCH_BYTES];
    uint8_t stream_emit_buffer[AUDIO_CAPTURE_STREAM_BATCH_BYTES];
} audio_capture_export_state_t;

/* ---------- Shared state ---------- */

static bool s_started;
static i2s_chan_handle_t s_i2s_rx_handle;

#ifdef CONFIG_AUDIO_CAPTURE_MIC_ES8311
static i2c_master_bus_handle_t s_i2c_bus_handle;
static esp_codec_dev_handle_t s_codec_handle;
#endif

static TaskHandle_t s_capture_task_handle;
static volatile bool s_idle_power_save_requested;
static bool s_i2s_low_power_disabled;
static volatile bool s_ota_suspended;
static uint32_t s_frame_count;
static uint32_t s_frame_captured_count;
#ifdef CONFIG_AUDIO_CAPTURE_MIC_ES8311
static uint32_t s_overflow_count;
static uint32_t s_underrun_count;
#endif
static uint32_t s_dropped_frame_count;
static uint32_t s_i2s_stall_recovery_count;
static audio_capture_export_state_t s_export_state;
static SemaphoreHandle_t s_state_mutex;
/*
 * Session ids cross the BLE reconnect boundary.  A plain per-boot counter
 * restarted at 1 after USB/WDT reset, so the host's orphan-tail quarantine
 * could mistake the first post-reset session for a replay of an old one.
 * Keep the familiar monotonically increasing low word for diagnostics, but
 * put it in a boot-local random namespace.  The namespace is regenerated if
 * the low word wraps, so a single boot never reuses an id.
 */
static uint16_t s_session_id_boot_namespace;
static uint16_t s_session_id_counter;
static audio_capture_voice_activity_handler_t s_voice_activity_handler;
static volatile bool s_voice_activation_monitoring;
static volatile uint8_t s_raw_input_level_percent;
/* Ordinary task-owned PCM history: never a DMA target or Flash API input. */
static int16_t (*s_voice_preroll)[AUDIO_CAPTURE_FRAME_SAMPLES];
static uint8_t s_voice_preroll_levels[AUDIO_CAPTURE_VOICE_PREROLL_FRAMES];
static uint16_t s_voice_preroll_write_index;
static uint16_t s_voice_preroll_count;
static uint16_t s_session_preroll_start_index;
static uint16_t s_session_preroll_count;

static esp_err_t audio_capture_i2s_init(void);

static uint16_t audio_capture_next_boot_namespace(uint16_t previous)
{
    uint16_t namespace_id = (uint16_t)(esp_random() & UINT16_MAX);
    if (namespace_id == 0u || namespace_id == previous) {
        namespace_id = (uint16_t)(previous + 1u);
        if (namespace_id == 0u) {
            namespace_id = 1u;
        }
    }
    return namespace_id;
}

static uint32_t audio_capture_next_session_id(void)
{
    if (s_session_id_boot_namespace == 0u) {
        s_session_id_boot_namespace = audio_capture_next_boot_namespace(0u);
    }

    uint16_t counter = (uint16_t)(s_session_id_counter + 1u);
    if (counter == 0u) {
        s_session_id_boot_namespace =
            audio_capture_next_boot_namespace(s_session_id_boot_namespace);
        counter = 1u;
    }
    s_session_id_counter = counter;
    return ((uint32_t)s_session_id_boot_namespace << 16) | (uint32_t)counter;
}
#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
/* ESP-IDF returns the right PDM slot first in a stereo PCM buffer. Keep the
 * physical SELECT strap separate from that buffer layout so SELECT=GND still
 * means the left microphone slot rather than buffer element zero. */
#if CONFIG_AUDIO_CAPTURE_SPH0655_SLOT_RIGHT
static const int s_pdm_selected_slot = 1;
static const int s_pdm_active_buffer_index = 0;
#else
static const int s_pdm_selected_slot = 0;
static const int s_pdm_active_buffer_index = 1;
#endif
static uint32_t s_pdm_session_raw_slot_peak[2];
static uint64_t s_pdm_session_raw_slot_abs_sum[2];
static uint64_t s_pdm_session_raw_slot_samples;
static uint64_t s_pdm_session_raw_slot_equal_samples;
static uint64_t s_pdm_session_raw_slot_delta_abs_sum;
#endif
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
static const esp_afe_sr_iface_t *s_pdm_afe_handle;
static esp_afe_sr_data_t *s_pdm_afe_data;
static int16_t *s_pdm_afe_feed_buffer;
static int16_t *s_pdm_afe_fetch_buffer;
static size_t s_pdm_afe_feed_samples;
static size_t s_pdm_afe_fetch_samples;
static size_t s_pdm_afe_feed_filled;
static srmodel_list_t *s_pdm_srmodels;
static void *s_pdm_agc_handle;
static int16_t s_pdm_agc_input_buffer[AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES];
static int16_t s_pdm_agc_output_buffer[AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES];
static size_t s_pdm_agc_filled;
static int16_t s_pdm_afe_emit_buffer[AUDIO_CAPTURE_FRAME_SAMPLES];
static size_t s_pdm_afe_emit_filled;
static volatile bool s_pdm_afe_session_boundary_requested;
static volatile bool s_pdm_afe_session_boundary_applied;
static volatile bool s_pdm_afe_session_warmup_ready;
static volatile bool s_pdm_afe_stop_drain_requested;
static volatile bool s_pdm_afe_stop_drain_feed_cutoff_ack;
static volatile bool s_pdm_afe_stop_drain_complete;
static uint32_t s_pdm_afe_input_frames;
static uint32_t s_pdm_afe_output_frames;
static uint32_t s_pdm_pre_afe_gain_q8 =
    AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_MAX_NUM *
    AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_Q8_ONE;
static uint32_t s_pdm_afe_session_input_peak;
static uint64_t s_pdm_afe_session_input_abs_sum;
static uint64_t s_pdm_afe_session_input_samples;
static uint64_t s_pdm_afe_session_input_clipped_samples;
static uint32_t s_pdm_afe_session_pre_vad_peak;
static uint64_t s_pdm_afe_session_pre_vad_abs_sum;
static uint64_t s_pdm_afe_session_pre_vad_samples;
static uint64_t s_pdm_afe_session_pre_vad_clipped_samples;
static uint64_t s_pdm_afe_session_agc_input_abs_sum;
static uint64_t s_pdm_afe_session_agc_output_abs_sum;
static uint64_t s_pdm_afe_session_agc_samples;
static uint32_t s_pdm_afe_session_output_peak;
static uint64_t s_pdm_afe_session_output_abs_sum;
static uint64_t s_pdm_afe_session_output_samples;
static uint64_t s_pdm_afe_session_output_clipped_samples;
static uint32_t s_pdm_afe_session_limiter_input_peak;
static uint32_t s_pdm_afe_session_limited_frames;
static uint32_t s_pdm_afe_session_limiter_max_reduction_permille;
static denzic_audio_leveling_v1_config_t s_pdm_leveling_config;
static denzic_audio_leveling_v1_state_t s_pdm_leveling_state;
static denzic_audio_leveling_v1_stats_t s_pdm_leveling_session_stats;
static uint32_t s_pdm_leveling_stats_session_id;
static bool s_pdm_leveling_speech_detected;
static uint32_t s_pdm_leveling_last_noise_floor_mean_abs;
static uint32_t s_pdm_leveling_last_allowed_gain_permille;
static uint32_t s_pdm_vad_noise_floor_q8 =
    AUDIO_CAPTURE_PDM_VAD_NOISE_INITIAL_MEAN_ABS << 8U;
static uint32_t s_pdm_vad_last_diagnostic_threshold;
static uint32_t s_pdm_vad_last_speech_mean_abs;
static uint32_t s_pdm_vad_low_snr_speech_frames;
static uint32_t s_pdm_afe_stop_drain_output_frames;
static size_t s_pdm_afe_stop_drain_padding_samples;
static TaskHandle_t s_pdm_afe_fetch_task_handle;
static void audio_capture_log_pdm_afe_session_signal(uint32_t session_id);
#endif
#endif
static esp_err_t audio_capture_send_session_preroll(
    uint32_t session_id,
    uint16_t frame_count,
    uint16_t *next_packet_sequence);

static bool s_capture_transport_backpressure_active;
static uint32_t s_capture_transport_backpressure_events;

static void audio_capture_wake_task(void)
{
    if (s_capture_task_handle != NULL) {
        xTaskNotifyGive(s_capture_task_handle);
    }
#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
    if (s_pdm_afe_fetch_task_handle != NULL) {
        xTaskNotifyGive(s_pdm_afe_fetch_task_handle);
    }
#endif
#endif
}

/* Keep the capture and AFE fetch loops on one scheduler contract.  This is
 * deliberately time based rather than frame based: driver queues may drain in
 * a burst, while an AFE error result may return immediately with no PCM.  The
 * helper is safe to call after every loop branch and performs only one tick of
 * delay when the bounded runnable budget is exceeded. */
static void audio_capture_yield_if_over_budget(int64_t *budget_started_us)
{
    if (budget_started_us == NULL) {
        return;
    }

    int64_t now_us = esp_timer_get_time();
    if (now_us - *budget_started_us < AUDIO_CAPTURE_IDLE_BUDGET_US) {
        return;
    }

    *budget_started_us = now_us;
    vTaskDelay(1);
    watchdog_platform_feed_current_task();
}

static esp_err_t audio_capture_voice_preroll_init(void)
{
    if (s_voice_preroll != NULL) {
        return ESP_OK;
    }

    s_voice_preroll = heap_caps_calloc(
        1u,
        AUDIO_CAPTURE_VOICE_PREROLL_BYTES,
        MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (s_voice_preroll == NULL) {
        ESP_LOGE(
            TAG,
            "voice preroll PSRAM allocation failed bytes=%u",
            (unsigned)AUDIO_CAPTURE_VOICE_PREROLL_BYTES);
        return ESP_ERR_NO_MEM;
    }
    ESP_LOGI(
        TAG,
        "voice preroll allocated in PSRAM bytes=%u",
        (unsigned)AUDIO_CAPTURE_VOICE_PREROLL_BYTES);
    return ESP_OK;
}

static const char *audio_capture_static_unavailable_reason(void)
{
#if defined(CONFIG_LISTENER_BOARD_PROFILE_V2_N16R8) && CONFIG_LISTENER_BOARD_PROFILE_V2_N16R8 && \
    defined(CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM) && CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM && \
    !CONFIG_AUDIO_CAPTURE_V2_MIC_INTERFACE_VALIDATED
    return AUDIO_CAPTURE_V2_MIC_BLOCKER;
#else
    return NULL;
#endif
}

/* ---------- Shared helpers ---------- */

