Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
static void audio_capture_export_cleanup(void)
{
    memset(&s_export_state, 0, sizeof(s_export_state));
    s_capture_transport_backpressure_active = false;
    s_capture_transport_backpressure_events = 0;
#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
    s_pdm_afe_session_boundary_requested = false;
    s_pdm_afe_session_boundary_applied = false;
    s_pdm_afe_session_warmup_ready = false;
    s_pdm_afe_stop_drain_requested = false;
    s_pdm_afe_stop_drain_feed_cutoff_ack = false;
    s_pdm_afe_stop_drain_complete = false;
#endif
#endif
}

static uint8_t audio_capture_frame_level_percent(const int16_t *frame_buffer)
{
    if (frame_buffer == NULL) {
        return 0U;
    }

    uint32_t sum_abs = 0U;
    uint32_t peak_abs = 0U;
    for (size_t index = 0; index < AUDIO_CAPTURE_FRAME_SAMPLES; ++index) {
        int32_t sample = frame_buffer[index];
        uint32_t abs_sample = sample < 0 ? (uint32_t)(-sample) : (uint32_t)sample;
        sum_abs += abs_sample;
        if (abs_sample > peak_abs) {
            peak_abs = abs_sample;
        }
    }

    uint32_t average_abs = sum_abs / AUDIO_CAPTURE_FRAME_SAMPLES;
    uint32_t weighted_level = ((average_abs * 3U) + peak_abs) / 4U;
    if (weighted_level <= AUDIO_CAPTURE_LEVEL_NOISE_FLOOR) {
        return 0U;
    }
    if (weighted_level >= AUDIO_CAPTURE_LEVEL_FULL_SCALE) {
        return 100U;
    }
    return (uint8_t)(((weighted_level - AUDIO_CAPTURE_LEVEL_NOISE_FLOOR) * 100U) /
                     (AUDIO_CAPTURE_LEVEL_FULL_SCALE - AUDIO_CAPTURE_LEVEL_NOISE_FLOOR));
}

static void audio_capture_update_recording_level_from_raw_input(
    const int16_t *raw_frame_buffer)
{
    uint8_t level_percent =
        audio_capture_frame_level_percent(raw_frame_buffer);
    s_raw_input_level_percent = level_percent;
    status_led_set_recording_level(level_percent);
}

static void audio_capture_note_transport_backpressure(void)
{
    ble_audio_stream_backpressure_t pressure = {0};
    ble_audio_stream_get_backpressure(&pressure);

    bool transport_backpressured =
        pressure.transport_session_active && pressure.pause_recommended;
    if (transport_backpressured != s_capture_transport_backpressure_active) {
        s_capture_transport_backpressure_active = transport_backpressured;
        uint32_t session_id = 0;
        if (s_state_mutex != NULL &&
            xSemaphoreTake(s_state_mutex, pdMS_TO_TICKS(2)) == pdTRUE) {
            session_id = s_export_state.session_id;
            xSemaphoreGive(s_state_mutex);
        }
        if (transport_backpressured) {
            s_capture_transport_backpressure_events++;
        }
        ESP_LOGW(
            TAG,
            "record transport backpressure %s: session=%" PRIu32 " queued=%" PRIu32 "/%" PRIu32 " pool=%" PRIu32 "/%" PRIu32 " pressure=%" PRIu32 "%% capture_continues=1 events=%" PRIu32,
            transport_backpressured ? "observed" : "cleared",
            session_id,
            pressure.queue_depth,
            pressure.queue_capacity,
            pressure.audio_pool_in_use,
            pressure.audio_pool_capacity,
            pressure.pressure_percent,
            s_capture_transport_backpressure_events);
        diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_BACKPRESSURE,
                 transport_backpressured ? DIAG_SEV_WARN : DIAG_SEV_INFO,
                 session_id,
                 transport_backpressured ? 1U : 2U,
                 pressure.queue_depth,
                 pressure.audio_pool_in_use);
    }
}

static uint32_t audio_capture_packet_safe_total_frames(uint16_t payload_bytes)
{
    if (payload_bytes == 0) {
        return 0;
    }

    uint64_t max_pcm_bytes = (uint64_t)UINT16_MAX * (uint64_t)payload_bytes;
    uint64_t max_frames = max_pcm_bytes / AUDIO_CAPTURE_FRAME_BYTES;
    if (max_frames > UINT32_MAX) {
        return UINT32_MAX;
    }

    return (uint32_t)max_frames;
}

static bool audio_capture_packet_sequence_can_advance(uint16_t next_packet_sequence, uint16_t packet_count)
{
    return packet_count > 0 && (uint32_t)next_packet_sequence + packet_count <= UINT16_MAX;
}

static uint16_t audio_capture_session_error_from_stream_result(esp_err_t result)
{
    switch (result) {
        case ESP_ERR_TIMEOUT:
            return LISTENER_AUDIO_SESSION_ERROR_QUEUE_FULL;
        case ESP_ERR_INVALID_STATE:
            return LISTENER_AUDIO_SESSION_ERROR_LINK_LOST;
        case ESP_ERR_NO_MEM:
            return LISTENER_AUDIO_SESSION_ERROR_NO_MEMORY;
        case ESP_ERR_INVALID_SIZE:
            return LISTENER_AUDIO_SESSION_ERROR_PACKET_TOO_LARGE;
        default:
            break;
    }

    return LISTENER_AUDIO_SESSION_ERROR_TRANSPORT;
}

static esp_err_t audio_capture_apply_idle_power_save(bool enabled)
{
    if (!s_started || s_i2s_rx_handle == NULL) {
        return ESP_ERR_INVALID_STATE;
    }

    if (enabled == s_i2s_low_power_disabled) {
        return ESP_OK;
    }

    esp_err_t ret = ESP_OK;
    if (enabled) {
#ifdef CONFIG_AUDIO_CAPTURE_MIC_ES8311
        if (s_codec_handle != NULL) {
            int mute_ret = esp_codec_dev_set_in_mute(s_codec_handle, true);
            if (mute_ret != ESP_CODEC_DEV_OK) {
                ESP_LOGW(TAG, "codec input mute failed before idle power save: %d", mute_ret);
            }
        }
#endif
        ret = i2s_channel_disable(s_i2s_rx_handle);
        /* ESP-IDF returns INVALID_STATE when the channel is already disabled. */
        if (ret == ESP_ERR_INVALID_STATE) {
            ret = ESP_OK;
        }
        if (ret == ESP_OK) {
            s_i2s_low_power_disabled = true;
        }
    } else {
        ret = i2s_channel_enable(s_i2s_rx_handle);
        /* ESP-IDF returns INVALID_STATE when the channel is already enabled. */
        if (ret == ESP_ERR_INVALID_STATE) {
            ret = ESP_OK;
        }
        if (ret == ESP_OK) {
            s_i2s_low_power_disabled = false;
#ifdef CONFIG_AUDIO_CAPTURE_MIC_ES8311
            if (s_codec_handle != NULL) {
                int mute_ret = esp_codec_dev_set_in_mute(s_codec_handle, false);
                if (mute_ret != ESP_CODEC_DEV_OK) {
                    ESP_LOGW(TAG, "codec input unmute failed after idle power save: %d", mute_ret);
                }
                /* Re-assert gain after mute/I2S cycle — some boards leave the
                 * ADC soft after idle and owner sees only ambient-level PCM. */
                int gain_ret = esp_codec_dev_set_in_gain(
                    s_codec_handle,
                    AUDIO_CAPTURE_INPUT_GAIN_DB);
                if (gain_ret != ESP_CODEC_DEV_OK) {
                    ESP_LOGW(
                        TAG,
                        "codec input gain restore failed after idle power save: %d",
                        gain_ret);
                }
            }
#endif
        }
    }

    ESP_LOGI(
        TAG,
        "audio idle power save %s: %s",
        enabled ? "enabled" : "disabled",
        esp_err_to_name(ret));
    diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_IDLE_POWER,
             ret == ESP_OK ? DIAG_SEV_INFO : DIAG_SEV_WARN,
             enabled ? 1 : 0, ret, 0, 0);
    return ret;
}

/* ---------- Session API (shared) ---------- */

esp_err_t audio_capture_session_begin_with_preroll(uint32_t pre_roll_ms)
{
    const char *unavailable_reason = audio_capture_static_unavailable_reason();
    if (unavailable_reason != NULL) {
        ESP_LOGW(TAG, "record session start rejected: audio capture unavailable: %s", unavailable_reason);
        diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_SESSION_REJ, DIAG_SEV_WARN,
                 3, ESP_ERR_NOT_SUPPORTED, 0, 0);
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (!s_started) {
        ESP_LOGW(TAG, "record session start rejected: audio capture not started");
        diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_SESSION_REJ, DIAG_SEV_WARN,
                 4, ESP_ERR_INVALID_STATE, 0, 0);
        return ESP_ERR_INVALID_STATE;
    }
    if (s_ota_suspended) {
        ESP_LOGW(TAG, "record session start rejected: OTA audio suspension active");
        return ESP_ERR_INVALID_STATE;
    }

    s_idle_power_save_requested = false;
    (void)audio_capture_apply_idle_power_save(false);

    if (s_state_mutex == NULL || xSemaphoreTake(s_state_mutex, portMAX_DELAY) != pdTRUE) {
        return ESP_ERR_INVALID_STATE;
    }

    if (s_export_state.requested || s_export_state.active) {
        xSemaphoreGive(s_state_mutex);
        return ESP_ERR_INVALID_STATE;
    }

