Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
    if (!ble_audio_stream_is_ready()) {
        xSemaphoreGive(s_state_mutex);
        ESP_LOGW(TAG, "record session start rejected: BLE audio transport not ready");
        diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_SESSION_REJ, DIAG_SEV_WARN, 1, 0, 0, 0);
        return ESP_ERR_INVALID_STATE;
    }

    uint16_t payload_bytes = ble_audio_stream_get_audio_payload_bytes();
    uint32_t packet_safe_total_frames = audio_capture_packet_safe_total_frames(payload_bytes);
    if (packet_safe_total_frames == 0) {
        xSemaphoreGive(s_state_mutex);
        ESP_LOGW(TAG, "record session start rejected: audio payload unavailable");
        diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_SESSION_REJ, DIAG_SEV_WARN, 2, 0, 0, 0);
        return ESP_ERR_INVALID_SIZE;
    }

    /* Use packet_safe_total_frames as the only limit (protocol-level packet
     * sequence overflow protection). If payload is unavailable, this will be 0
     * and we reject; otherwise recording continues until user stops or protocol
     * limit is approached. */
    uint32_t total_frames = packet_safe_total_frames;

    memset(&s_export_state, 0, sizeof(s_export_state));
    s_export_state.mode = AUDIO_CAPTURE_EXPORT_MODE_SESSION;
    s_export_state.duration_seconds = 0;
    s_export_state.total_frames = total_frames;
    s_export_state.pcm_bytes_total = 0;
    s_export_state.session_id = audio_capture_next_session_id();
    s_export_state.start_origin = pre_roll_ms > 0u
        ? LISTENER_AUDIO_SESSION_START_ORIGIN_VOICE_ACTIVATION
        : LISTENER_AUDIO_SESSION_START_ORIGIN_USER;
    uint32_t requested_pre_roll_frames =
        (pre_roll_ms + AUDIO_CAPTURE_FRAME_MS - 1u) /
        AUDIO_CAPTURE_FRAME_MS;
    if (requested_pre_roll_frames > AUDIO_CAPTURE_VOICE_PREROLL_FRAMES) {
        requested_pre_roll_frames = AUDIO_CAPTURE_VOICE_PREROLL_FRAMES;
    }
    const uint16_t buffered_pre_roll_frames = s_voice_preroll_count;
    s_session_preroll_count = (uint16_t)requested_pre_roll_frames;
    if (s_session_preroll_count > s_voice_preroll_count) {
        s_session_preroll_count = s_voice_preroll_count;
    }
    s_session_preroll_start_index = (uint16_t)(
        (s_voice_preroll_write_index +
         AUDIO_CAPTURE_VOICE_PREROLL_FRAMES -
         s_session_preroll_count) %
        AUDIO_CAPTURE_VOICE_PREROLL_FRAMES);
    uint32_t session_id = s_export_state.session_id;
    uint16_t session_start_origin = s_export_state.start_origin;
    uint16_t session_preroll_count = s_session_preroll_count;
    uint32_t session_max_seconds = (s_export_state.total_frames * AUDIO_CAPTURE_FRAME_MS) / 1000U;

#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
    /* Apply the session boundary only in the capture task. It clears partial
     * PCM while preserving the trained NS/AGC state and the calibrated
     * pre-AFE gain.  A previous loud session may have driven that gain close
     * to 1x, so raise only a bounded startup floor; resetting to the 32x
     * ceiling made the first pre-roll peak rebase too aggressively and could
     * remove the owner's wake phrase before the detector saw it.  The
     * per-frame peak guard still reduces gain immediately for close speech. */
    const uint32_t session_floor_gain_q8 =
        AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_SESSION_FLOOR_NUM *
        AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_Q8_ONE;
    if (s_pdm_pre_afe_gain_q8 < session_floor_gain_q8) {
        s_pdm_pre_afe_gain_q8 = session_floor_gain_q8;
    }
    s_pdm_afe_session_boundary_requested = true;
    s_pdm_afe_session_boundary_applied = false;
    s_pdm_afe_session_warmup_ready = false;
    s_export_state.warmup_pending = true;
    s_pdm_afe_stop_drain_requested = false;
    s_pdm_afe_stop_drain_feed_cutoff_ack = false;
    s_pdm_afe_stop_drain_complete = false;
    s_pdm_afe_stop_drain_output_frames = 0;
    s_pdm_afe_stop_drain_padding_samples = 0;
    s_pdm_afe_session_input_peak = 0;
    s_pdm_afe_session_input_abs_sum = 0;
    s_pdm_afe_session_input_samples = 0;
    s_pdm_afe_session_input_clipped_samples = 0;
    s_pdm_afe_session_pre_vad_peak = 0;
    s_pdm_afe_session_pre_vad_abs_sum = 0;
    s_pdm_afe_session_pre_vad_samples = 0;
    s_pdm_afe_session_pre_vad_clipped_samples = 0;
    s_pdm_afe_session_agc_input_abs_sum = 0;
    s_pdm_afe_session_agc_output_abs_sum = 0;
    s_pdm_afe_session_agc_samples = 0;
    s_pdm_afe_session_limiter_input_peak = 0;
    s_pdm_afe_session_limited_frames = 0;
    s_pdm_afe_session_limiter_max_reduction_permille = 0;
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
    memset(s_pdm_session_raw_slot_peak, 0, sizeof(s_pdm_session_raw_slot_peak));
    memset(s_pdm_session_raw_slot_abs_sum, 0, sizeof(s_pdm_session_raw_slot_abs_sum));
    s_pdm_session_raw_slot_samples = 0;
    s_pdm_session_raw_slot_equal_samples = 0;
    s_pdm_session_raw_slot_delta_abs_sum = 0;
#endif
#endif
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
    ESP_LOGI(
            TAG,
            "SPH0655 PDM session slot: session_id=%" PRIu32 " selected=%s",
            session_id,
            s_pdm_selected_slot == 0 ? "left" : "right");
#else
    ESP_LOGI(TAG, "SPH0655 PDM session: session_id=%" PRIu32 " mode=standard-mono", session_id);
#endif
#endif

    s_export_state.requested = true;
    xSemaphoreGive(s_state_mutex);
    audio_capture_wake_task();

#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
    /* A cold PDM/AFE path can take hundreds of milliseconds before its first
     * output that belongs to input after the session boundary. Do not expose
     * the recording state during that blind interval: an immediate speaker
     * otherwise loses the first word. The capture and fetch tasks run on the
     * other cores while this control task waits. */
    TickType_t warmup_started = xTaskGetTickCount();
    TickType_t warmup_timeout = pdMS_TO_TICKS(
        AUDIO_CAPTURE_PDM_SESSION_WARMUP_TIMEOUT_MS);
    while (!s_pdm_afe_session_warmup_ready &&
           (xTaskGetTickCount() - warmup_started) < warmup_timeout) {
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    uint32_t warmup_elapsed_ms =
        (uint32_t)((xTaskGetTickCount() - warmup_started) * portTICK_PERIOD_MS);
    bool warmup_activation_ready = false;
    if (xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
        if (s_pdm_afe_session_warmup_ready &&
            s_export_state.requested &&
            s_export_state.session_id == session_id) {
            s_export_state.requested = false;
            s_export_state.active = true;
            s_export_state.captured_frames = session_preroll_count;
            s_export_state.pcm_bytes_written =
                (size_t)session_preroll_count * AUDIO_CAPTURE_FRAME_BYTES;
            s_export_state.stream_next_packet_sequence = 0;
            s_export_state.stream_batch_frame_count = 0;
            s_export_state.stream_batch_raw_input_level_percent = 0u;
            s_export_state.ble_session_started = true;
            warmup_activation_ready = true;
        }
        xSemaphoreGive(s_state_mutex);
    }
    ESP_LOGI(
        TAG,
        "PDM AFE session warmup: session_id=%" PRIu32
        " ready=%u elapsed_ms=%" PRIu32 " feed_blocks=%" PRIu32,
        session_id,
        s_pdm_afe_session_warmup_ready ? 1U : 0U,
        warmup_elapsed_ms,
        s_pdm_afe_input_frames);
    if (!warmup_activation_ready) {
        esp_err_t warmup_ret = s_pdm_afe_session_warmup_ready
            ? ESP_ERR_INVALID_STATE
            : ESP_ERR_TIMEOUT;
        if (xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
            if (s_export_state.session_id == session_id) {
                audio_capture_export_cleanup();
            }
            xSemaphoreGive(s_state_mutex);
        }
        ESP_LOGW(
            TAG,
            "record session rejected after AFE warmup: session_id=%" PRIu32
            " ret=%s",
            session_id,
            esp_err_to_name(warmup_ret));
        return warmup_ret;
    }

    /* Queue START before exposing recording state to the owner. On a freshly
     * attached Type process the transport queue can need several connection
     * intervals; doing this on the control task keeps AFE fetch running and
     * prevents its small ring from overwriting speech while START waits. */
    bool stream_start_queued = false;
    uint16_t pre_roll_packet_count = 0u;
    esp_err_t stream_start_ret =
        ble_audio_stream_send_session_start_with_origin(
            session_id,
            session_start_origin);
    stream_start_queued = stream_start_ret == ESP_OK;
    if (stream_start_ret == ESP_OK && session_preroll_count > 0u) {
        stream_start_ret = audio_capture_send_session_preroll(
            session_id,
            session_preroll_count,
            &pre_roll_packet_count);
        if (stream_start_ret == ESP_OK &&
            xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
            if (s_export_state.active &&
                s_export_state.session_id == session_id) {
                s_export_state.stream_next_packet_sequence =
                    pre_roll_packet_count;
            }
            xSemaphoreGive(s_state_mutex);
        }
    }
    if (stream_start_ret != ESP_OK) {
        if (stream_start_queued) {
            (void)ble_audio_stream_send_session_error(
                session_id,
                pre_roll_packet_count,
                audio_capture_session_error_from_stream_result(
                    stream_start_ret));
        }
        if (xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
            if (s_export_state.session_id == session_id) {
                audio_capture_export_cleanup();
            }
            xSemaphoreGive(s_state_mutex);
        }
        ESP_LOGW(
            TAG,
            "stream session start failed after AFE warmup: session_id=%" PRIu32
            " ret=%s",
            session_id,
            esp_err_to_name(stream_start_ret));
        return stream_start_ret;
    }
    if (xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
        if (s_export_state.active &&
            s_export_state.session_id == session_id) {
            s_export_state.warmup_pending = false;
        }
        xSemaphoreGive(s_state_mutex);
    }
    if (session_preroll_count > 0u) {
        ESP_LOGI(
            TAG,
            "stream session preroll queued: session_id=%" PRIu32
            " frames=%u ms=%u",
            session_id,
            session_preroll_count,
            session_preroll_count * AUDIO_CAPTURE_FRAME_MS);
        /* The ring is continuous wake history, not one-shot session storage.
         * Keep the snapshot after sending it, then let live capture overwrite
         * it in rolling order. A 3.5 s hidden candidate may end between the
         * words of 「开始录音」; clearing here made the next candidate lose
         * the phrase prefix even though voice monitoring never stopped. */
        if (xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
            s_session_preroll_count = 0u;
            xSemaphoreGive(s_state_mutex);
        }
    }
    ESP_LOGI(
        TAG,
        "stream session start queued: session_id=%" PRIu32,
        session_id);
    audio_capture_wake_task();
#endif
#endif
    ESP_LOGI(
        TAG,
        "record session begin requested: session_id=%" PRIu32
        " requested_preroll_ms=%" PRIu32 " buffered_preroll_ms=%u"
        " actual_preroll_ms=%u"
        " buffer_ms=%u buffer_bytes=%u packet_payload_bytes=%u packet_safe_max_s=%" PRIu32,
        session_id,
        pre_roll_ms,
        buffered_pre_roll_frames * AUDIO_CAPTURE_FRAME_MS,
        session_preroll_count * AUDIO_CAPTURE_FRAME_MS,
        AUDIO_CAPTURE_STREAM_BATCH_FRAMES * AUDIO_CAPTURE_FRAME_MS,
        (unsigned)AUDIO_CAPTURE_STREAM_BATCH_BYTES,
        payload_bytes,
        session_max_seconds);
    diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_SESSION, DIAG_SEV_INFO, 1, session_id, 0, 0);
    return ESP_OK;
}

esp_err_t audio_capture_session_begin(void)
{
    return audio_capture_session_begin_with_preroll(0u);
}

esp_err_t audio_capture_session_stop(void)
{
    return audio_capture_session_stop_with_origin(
        AUDIO_CAPTURE_STOP_ORIGIN_USER);
}

esp_err_t audio_capture_session_stop_with_origin(
    audio_capture_stop_origin_t origin)
{
    if (s_state_mutex == NULL || xSemaphoreTake(s_state_mutex, portMAX_DELAY) != pdTRUE) {
        return ESP_ERR_INVALID_STATE;
    }

    if (!(s_export_state.requested || s_export_state.active) ||
        s_export_state.mode != AUDIO_CAPTURE_EXPORT_MODE_SESSION) {
        xSemaphoreGive(s_state_mutex);
        return ESP_ERR_INVALID_STATE;
    }

    s_export_state.stop_requested = true;
    s_export_state.stop_origin = (uint16_t)origin;
#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
    s_pdm_afe_stop_drain_requested = true;
    s_pdm_afe_stop_drain_feed_cutoff_ack = false;
    s_pdm_afe_stop_drain_complete = false;
#endif
#endif
    xSemaphoreGive(s_state_mutex);
    ESP_LOGI(TAG, "record session stop requested origin=%u", (unsigned)origin);
    return ESP_OK;
}

esp_err_t audio_capture_session_cancel(void)
{
    if (s_state_mutex == NULL || xSemaphoreTake(s_state_mutex, portMAX_DELAY) != pdTRUE) {
        return ESP_ERR_INVALID_STATE;
    }

    if (!(s_export_state.requested || s_export_state.active) ||
        s_export_state.mode != AUDIO_CAPTURE_EXPORT_MODE_SESSION) {
        xSemaphoreGive(s_state_mutex);
        return ESP_ERR_INVALID_STATE;
    }

