Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
    if (s_export_state.requested && !s_export_state.active) {
        audio_capture_export_cleanup();
        xSemaphoreGive(s_state_mutex);
        ESP_LOGI(TAG, "record session canceled before activation");
        return ESP_OK;
    }

    s_export_state.cancel_requested = true;
#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
    s_pdm_afe_stop_drain_requested = false;
    s_pdm_afe_stop_drain_feed_cutoff_ack = false;
    s_pdm_afe_stop_drain_complete = false;
#endif
#endif
    xSemaphoreGive(s_state_mutex);
    ESP_LOGI(TAG, "record session cancel requested");
    return ESP_OK;
}

bool audio_capture_session_is_active(void)
{
    if (s_state_mutex == NULL || xSemaphoreTake(s_state_mutex, portMAX_DELAY) != pdTRUE) {
        return false;
    }

    bool active = s_export_state.requested || s_export_state.active;
    xSemaphoreGive(s_state_mutex);
    return active;
}

esp_err_t audio_capture_set_idle_power_save(bool enabled)
{
    if (!enabled && s_ota_suspended) {
        enabled = true;
    }
    if (enabled) {
        s_voice_activation_monitoring = false;
        if (s_state_mutex != NULL &&
            xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
            s_voice_preroll_write_index = 0u;
            s_voice_preroll_count = 0u;
            s_session_preroll_count = 0u;
            if (s_voice_preroll != NULL) {
                memset(
                    s_voice_preroll,
                    0,
                    AUDIO_CAPTURE_VOICE_PREROLL_BYTES);
            }
            memset(s_voice_preroll_levels, 0, sizeof(s_voice_preroll_levels));
            s_raw_input_level_percent = 0u;
            xSemaphoreGive(s_state_mutex);
        }
    }
    s_idle_power_save_requested = enabled;
    audio_capture_wake_task();
    if (!enabled) {
        return audio_capture_apply_idle_power_save(false);
    }
    if (audio_capture_session_is_active()) {
        return ESP_ERR_INVALID_STATE;
    }
    return ESP_OK;
}

bool audio_capture_idle_power_save_is_applied(void)
{
    return s_i2s_low_power_disabled;
}

esp_err_t audio_capture_set_ota_suspended(bool suspended)
{
    if (!suspended) {
        if (s_i2s_rx_handle == NULL) {
            esp_err_t init_ret = audio_capture_i2s_init();
            if (init_ret != ESP_OK) {
                ESP_LOGE(
                    TAG,
                    "audio OTA I2S restore failed: %s",
                    esp_err_to_name(init_ret));
                return init_ret;
            }
            s_i2s_low_power_disabled = false;
        }
        s_ota_suspended = false;
        esp_err_t ret = audio_capture_set_idle_power_save(false);
        ESP_LOGI(
            TAG,
            "audio OTA suspension=0 applied=%u ret=%s",
            s_i2s_low_power_disabled ? 1U : 0U,
            esp_err_to_name(ret));
        return ret;
    }

    s_ota_suspended = true;
    esp_err_t ret = audio_capture_set_idle_power_save(true);
    const TickType_t suspend_started = xTaskGetTickCount();
    while (ret == ESP_OK &&
           !s_i2s_low_power_disabled &&
           (xTaskGetTickCount() - suspend_started) <
               pdMS_TO_TICKS(AUDIO_CAPTURE_OTA_SUSPEND_TIMEOUT_MS)) {
        vTaskDelay(1);
    }
    if (ret == ESP_OK && !s_i2s_low_power_disabled) {
        ret = ESP_ERR_TIMEOUT;
    }
    if (ret == ESP_OK && s_i2s_rx_handle != NULL) {
        ret = i2s_del_channel(s_i2s_rx_handle);
        if (ret == ESP_OK) {
            s_i2s_rx_handle = NULL;
        }
    }
    ESP_LOGI(
        TAG,
        "audio OTA suspension=1 applied=%u i2s_released=%u ret=%s",
        s_i2s_low_power_disabled ? 1U : 0U,
        s_i2s_rx_handle == NULL ? 1U : 0U,
        esp_err_to_name(ret));
    return ret;
}

void audio_capture_set_voice_activity_handler(
    audio_capture_voice_activity_handler_t handler)
{
    s_voice_activity_handler = handler;
}

esp_err_t audio_capture_set_voice_activation_monitoring(bool enabled)
{
    if (enabled && s_idle_power_save_requested) {
        /* Prefer wake-listen over audio idle power-save. Leaving this as a hard
         * failure made voice_auto_start permanently stuck after the first
         * 5 s audio-idle window (monitoring=0 ret=ESP_ERR_INVALID_STATE spam). */
        esp_err_t wake_ret = audio_capture_set_idle_power_save(false);
        if (wake_ret != ESP_OK && wake_ret != ESP_ERR_INVALID_STATE) {
            return wake_ret;
        }
        if (s_idle_power_save_requested) {
            return ESP_ERR_INVALID_STATE;
        }
    }
    s_voice_activation_monitoring = enabled;
    /* 不清空 preroll：保留跨录音会话的前缀缓冲。
     * 监听开启时环形缓冲连续累积，包括隐藏候选正在录制时；下一候选因此
     * 仍能拿到上一窗末尾的完整唤醒词，不会在 3.5 s 候选轮换处截断。
     * power-save（audio_capture_set_idle_power_save）仍保留清零：深度休眠唤醒后
     * 缓冲内容已过期，不应作为前缀使用。 */
    return ESP_OK;
}

bool audio_capture_voice_activation_monitoring_is_enabled(void)
{
    return s_voice_activation_monitoring;
}

/* ---------- Shared frame processing ---------- */

static esp_err_t audio_capture_send_session_preroll(
    uint32_t session_id,
    uint16_t frame_count,
    uint16_t *next_packet_sequence)
{
    if (next_packet_sequence == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    uint16_t packet_sequence = 0u;
    uint16_t emitted_frames = 0u;
    uint8_t batch[AUDIO_CAPTURE_STREAM_BATCH_BYTES];
    while (emitted_frames < frame_count) {
        uint16_t batch_frames =
            (uint16_t)(frame_count - emitted_frames);
        if (batch_frames > AUDIO_CAPTURE_STREAM_BATCH_FRAMES) {
            batch_frames = AUDIO_CAPTURE_STREAM_BATCH_FRAMES;
        }
        for (uint16_t i = 0u; i < batch_frames; ++i) {
            uint16_t ring_index = (uint16_t)(
                (s_session_preroll_start_index + emitted_frames + i) %
                AUDIO_CAPTURE_VOICE_PREROLL_FRAMES);
            memcpy(
                batch + ((size_t)i * AUDIO_CAPTURE_FRAME_BYTES),
                s_voice_preroll[ring_index],
                AUDIO_CAPTURE_FRAME_BYTES);
        }
        uint16_t pcm_bytes =
            (uint16_t)(batch_frames * AUDIO_CAPTURE_FRAME_BYTES);
        uint8_t raw_input_level_percent = 0u;
        for (uint16_t i = 0u; i < batch_frames; ++i) {
            uint16_t ring_index = (uint16_t)(
                (s_session_preroll_start_index + emitted_frames + i) %
                AUDIO_CAPTURE_VOICE_PREROLL_FRAMES);
            if (s_voice_preroll_levels[ring_index] >
                raw_input_level_percent) {
                raw_input_level_percent =
                    s_voice_preroll_levels[ring_index];
            }
        }
        uint16_t packet_count =
            ble_audio_stream_count_audio_packets(batch, pcm_bytes);
        esp_err_t ret = ble_audio_stream_send_session_audio(
            session_id,
            packet_sequence,
            batch,
            pcm_bytes,
            packet_count,
            raw_input_level_percent);
        if (ret != ESP_OK) {
            return ret;
        }
        packet_sequence = (uint16_t)(packet_sequence + packet_count);
        emitted_frames = (uint16_t)(emitted_frames + batch_frames);
    }
    *next_packet_sequence = packet_sequence;
    return ESP_OK;
}

