Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
static void audio_capture_process_frame(const int16_t *frame_buffer)
{
    s_frame_captured_count++;
    s_frame_count++;

    bool should_emit = false;
    bool should_cancel = false;
    bool stream_failed = false;
    bool should_transport_error = false;
    bool idle_for_logging = false;
    bool should_session_start = false;
    bool should_session_audio = false;
    bool should_session_stop = false;
    bool should_session_cancel = false;
    bool should_session_error = false;
    uint32_t session_id = 0;
    uint16_t packet_sequence_start = 0;
    uint16_t batch_pcm_bytes = 0;
    uint16_t expected_packet_count_at_end = 0;
    uint16_t session_start_origin = LISTENER_AUDIO_SESSION_START_ORIGIN_USER;
    uint16_t session_stop_origin = LISTENER_AUDIO_SESSION_STOP_ORIGIN_USER;
    uint16_t session_error_code = LISTENER_AUDIO_SESSION_ERROR_NONE;
    uint16_t packet_count = 0;
    uint8_t batch_raw_input_level_percent = 0u;
    const uint8_t *audio_batch_copy = NULL;

    if (xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
        /* Keep a continuous two-second wake history across hidden candidate
         * rotations. While a session snapshot is still being exported,
         * s_session_preroll_count stays non-zero and freezes the ring so the
         * sender cannot race an overwrite. Once it reaches zero, active live
         * PCM rolls into the same ring and becomes the next candidate's
         * overlap. */
        if (s_voice_activation_monitoring &&
            !s_export_state.requested &&
            (!s_export_state.active || s_session_preroll_count == 0u)) {
            memcpy(
                s_voice_preroll[s_voice_preroll_write_index],
                frame_buffer,
                AUDIO_CAPTURE_FRAME_BYTES);
            s_voice_preroll_levels[s_voice_preroll_write_index] =
                s_raw_input_level_percent;
            s_voice_preroll_write_index = (uint16_t)(
                (s_voice_preroll_write_index + 1u) %
                AUDIO_CAPTURE_VOICE_PREROLL_FRAMES);
            if (s_voice_preroll_count < AUDIO_CAPTURE_VOICE_PREROLL_FRAMES) {
                s_voice_preroll_count++;
            }
        }
        if (s_export_state.requested &&
            !s_export_state.warmup_pending &&
            !s_export_state.active) {
            s_export_state.requested = false;
            s_export_state.active = true;
            s_export_state.captured_frames = 0;
            s_export_state.pcm_bytes_written = 0;
            s_export_state.stream_next_packet_sequence = 0;
            s_export_state.stream_batch_frame_count = 0;
            s_export_state.stream_batch_raw_input_level_percent = 0u;
            s_export_state.ble_session_started = false;
            if (s_session_preroll_count > 0u) {
                s_export_state.captured_frames =
                    s_session_preroll_count;
                s_export_state.pcm_bytes_written =
                    (size_t)s_session_preroll_count *
                    AUDIO_CAPTURE_FRAME_BYTES;
            }
        }

        if (s_export_state.active &&
            !s_export_state.warmup_pending &&
            s_export_state.captured_frames < s_export_state.total_frames) {
            bool stop_boundary_requested =
                s_export_state.mode == AUDIO_CAPTURE_EXPORT_MODE_SESSION &&
                s_export_state.stop_requested;
#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
            if (stop_boundary_requested && s_pdm_afe_stop_drain_requested &&
                !s_pdm_afe_stop_drain_complete) {
                stop_boundary_requested = false;
            }
#endif
#endif
            bool hit_safety_max_duration = false;
            if (s_export_state.mode == AUDIO_CAPTURE_EXPORT_MODE_SESSION) {
                if (!s_export_state.ble_session_started) {
                    should_session_start = true;
                    session_id = s_export_state.session_id;
                    session_start_origin = s_export_state.start_origin;
                    s_export_state.ble_session_started = true;
                }

                /* Stop is a hard capture boundary; the frame that woke this
                 * call may already be after the user's stop edge. */
                if (!stop_boundary_requested) {
                    size_t batch_offset =
                        (size_t)s_export_state.stream_batch_frame_count * AUDIO_CAPTURE_FRAME_BYTES;
                    memcpy(s_export_state.stream_batch_buffer + batch_offset, frame_buffer, AUDIO_CAPTURE_FRAME_BYTES);
                    s_export_state.stream_batch_frame_count++;
                    if (s_raw_input_level_percent >
                        s_export_state.stream_batch_raw_input_level_percent) {
                        s_export_state.stream_batch_raw_input_level_percent =
                            s_raw_input_level_percent;
                    }
                    s_export_state.pcm_bytes_written += AUDIO_CAPTURE_FRAME_BYTES;

                    if (s_export_state.stream_batch_frame_count >= AUDIO_CAPTURE_STREAM_BATCH_FRAMES) {
                        session_id = s_export_state.session_id;
                        packet_sequence_start = s_export_state.stream_next_packet_sequence;
                        batch_pcm_bytes = AUDIO_CAPTURE_STREAM_BATCH_BYTES;
                        memcpy(s_export_state.stream_emit_buffer, s_export_state.stream_batch_buffer, batch_pcm_bytes);
                        audio_batch_copy = s_export_state.stream_emit_buffer;
                        batch_raw_input_level_percent =
                            s_export_state.stream_batch_raw_input_level_percent;
                        packet_count = ble_audio_stream_count_audio_packets(audio_batch_copy, batch_pcm_bytes);
                        if (!audio_capture_packet_sequence_can_advance(
                                s_export_state.stream_next_packet_sequence,
                                packet_count)) {
                            /* Protocol packet sequence limit reached; perform graceful
                             * session_stop instead of error so the host receives all
                             * audio up to this point with a clean termination. */
                            should_session_stop = true;
                            session_id = s_export_state.session_id;
                            expected_packet_count_at_end = s_export_state.stream_next_packet_sequence;
                            should_emit = true;
                            ESP_LOGI(
                                TAG,
                                "record session stopping at protocol limit: session_id=%" PRIu32 " next=%u add=%u",
                                session_id,
                                s_export_state.stream_next_packet_sequence,
                                packet_count);
                        } else {
                            should_session_audio = true;
                            s_export_state.stream_next_packet_sequence =
                                (uint16_t)(s_export_state.stream_next_packet_sequence + packet_count);
                            s_export_state.stream_batch_frame_count = 0;
                            s_export_state.stream_batch_raw_input_level_percent = 0u;
                        }
                    }
                }
            }

            if (!should_cancel && !stop_boundary_requested) {
                s_export_state.captured_frames++;
                hit_safety_max_duration = s_export_state.captured_frames >= s_export_state.total_frames;
            }

            if (!should_cancel && !should_session_stop &&
                s_export_state.mode == AUDIO_CAPTURE_EXPORT_MODE_SESSION &&
                (stop_boundary_requested || hit_safety_max_duration)) {
                if (hit_safety_max_duration) {
                    ESP_LOGI(
                        TAG,
                        "record session stopping at protocol limit (total_frames): session_id=%" PRIu32 " captured_frames=%" PRIu32,
                        s_export_state.session_id,
                        s_export_state.captured_frames);
                }
                s_export_state.duration_seconds =
                    (s_export_state.captured_frames * AUDIO_CAPTURE_FRAME_MS) / 1000U;

                if (s_export_state.stream_batch_frame_count > 0) {
                    session_id = s_export_state.session_id;
                    packet_sequence_start = s_export_state.stream_next_packet_sequence;
                    batch_pcm_bytes =
                        s_export_state.stream_batch_frame_count * AUDIO_CAPTURE_FRAME_BYTES;
                    memcpy(s_export_state.stream_emit_buffer, s_export_state.stream_batch_buffer, batch_pcm_bytes);
                    audio_batch_copy = s_export_state.stream_emit_buffer;
                    batch_raw_input_level_percent =
                        s_export_state.stream_batch_raw_input_level_percent;
                    packet_count = ble_audio_stream_count_audio_packets(audio_batch_copy, batch_pcm_bytes);
                    if (!audio_capture_packet_sequence_can_advance(
                            s_export_state.stream_next_packet_sequence,
                            packet_count)) {
                        /* Protocol limit at final batch; stop gracefully with
                         * whatever audio we have so far. */
                        ESP_LOGI(
                            TAG,
                            "record session stopping at protocol limit (final batch): session_id=%" PRIu32 " next=%u add=%u",
                            session_id,
                            s_export_state.stream_next_packet_sequence,
                            packet_count);
                    } else {
                        should_session_audio = true;
                        s_export_state.stream_next_packet_sequence =
                            (uint16_t)(s_export_state.stream_next_packet_sequence + packet_count);
                        s_export_state.stream_batch_frame_count = 0;
                        s_export_state.stream_batch_raw_input_level_percent = 0u;
                    }
                }
                if (!should_cancel) {
                    should_session_stop = true;
                    session_id = s_export_state.session_id;
                    expected_packet_count_at_end = s_export_state.stream_next_packet_sequence;
                    session_stop_origin = s_export_state.stop_origin;
                    should_emit = true;
                }
            }
        }

        if (s_export_state.active && s_export_state.cancel_requested) {
            should_cancel = true;
            if (s_export_state.mode == AUDIO_CAPTURE_EXPORT_MODE_SESSION) {
                should_session_cancel = s_export_state.ble_session_started;
                session_id = s_export_state.session_id;
                expected_packet_count_at_end = s_export_state.stream_next_packet_sequence;
            }
        }

        idle_for_logging = !s_export_state.active && !s_export_state.requested;
        xSemaphoreGive(s_state_mutex);
    }

    if (should_cancel) {
        if (should_session_error) {
            esp_err_t error_ret = ble_audio_stream_send_session_error(
                session_id,
                expected_packet_count_at_end,
                session_error_code);
            if (error_ret != ESP_OK) {
                ESP_LOGW(
                    TAG,
                    "stream session error failed: session_id=%" PRIu32 " expected_packet_count=%u error_code=%u ret=%s",
                    session_id,
                    expected_packet_count_at_end,
                    session_error_code,
                    esp_err_to_name(error_ret));
            }
        }
        if (should_session_cancel) {
            esp_err_t cancel_ret = ble_audio_stream_send_session_cancel(session_id, expected_packet_count_at_end);
            if (cancel_ret != ESP_OK) {
                ESP_LOGW(
                    TAG,
                    "stream session cancel failed: session_id=%" PRIu32 " expected_packet_count=%u ret=%s",
                    session_id,
                    expected_packet_count_at_end,
                    esp_err_to_name(cancel_ret));
            }
        }
        if (xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
            audio_capture_export_cleanup();
            xSemaphoreGive(s_state_mutex);
        }
        ESP_LOGI(TAG, "record session canceled");
    } else {
        if (should_session_start) {
            esp_err_t start_ret = ble_audio_stream_send_session_start_with_origin(
                session_id,
                session_start_origin);
            if (start_ret != ESP_OK) {
                stream_failed = true;
                should_transport_error = true;
                session_error_code = audio_capture_session_error_from_stream_result(start_ret);
                ESP_LOGW(TAG, "stream session start failed: session_id=%" PRIu32 " ret=%s", session_id, esp_err_to_name(start_ret));
            } else {
                ESP_LOGI(TAG, "stream session start queued: session_id=%" PRIu32, session_id);
                if (s_session_preroll_count > 0u) {
                    uint16_t pre_roll_packet_count = 0u;
                    esp_err_t pre_roll_ret =
                        audio_capture_send_session_preroll(
                            session_id,
                            s_session_preroll_count,
                            &pre_roll_packet_count);
                    if (pre_roll_ret != ESP_OK) {
                        stream_failed = true;
                        should_transport_error = true;
                        session_error_code =
                            audio_capture_session_error_from_stream_result(
                                pre_roll_ret);
                        ESP_LOGW(
                            TAG,
                            "stream session preroll failed: session_id=%" PRIu32
                            " frames=%u ret=%s",
                            session_id,
                            s_session_preroll_count,
                            esp_err_to_name(pre_roll_ret));
                    } else {
                        if (xSemaphoreTake(s_state_mutex, portMAX_DELAY) ==
                            pdTRUE) {
                            if (s_export_state.active &&
                                s_export_state.session_id == session_id) {
                                s_export_state.stream_next_packet_sequence =
                                    pre_roll_packet_count;
                            }
                            xSemaphoreGive(s_state_mutex);
                        }
                        ESP_LOGI(
                            TAG,
                            "stream session preroll queued: session_id=%" PRIu32
                            " frames=%u packets=%u ms=%u",
                            session_id,
                            s_session_preroll_count,
                            pre_roll_packet_count,
                            s_session_preroll_count *
                                AUDIO_CAPTURE_FRAME_MS);
                    }
                    s_session_preroll_count = 0u;
                }
            }
        }

        if (!stream_failed && should_session_audio) {
            esp_err_t audio_ret =
                ble_audio_stream_send_session_audio(
                    session_id,
                    packet_sequence_start,
                    audio_batch_copy,
                    batch_pcm_bytes,
                    packet_count,
                    batch_raw_input_level_percent);
            if (audio_ret != ESP_OK) {
                stream_failed = true;
                should_transport_error = true;
                session_error_code = audio_capture_session_error_from_stream_result(audio_ret);
                ESP_LOGW(
                    TAG,
                    "stream audio packet batch failed: session_id=%" PRIu32 " seq_start=%u packet_count=%u pcm_bytes=%u ret=%s",
                    session_id,
                    packet_sequence_start,
                    packet_count,
                    batch_pcm_bytes,
                    esp_err_to_name(audio_ret));
            } else if (packet_sequence_start == 0 ||
                       ((uint32_t)packet_sequence_start %
                        AUDIO_CAPTURE_STREAM_PROGRESS_LOG_PACKET_INTERVAL) == 0) {
                ESP_LOGI(
                    TAG,
                    "stream audio packet batch queued: session_id=%" PRIu32 " seq_start=%u packet_count=%u pcm_bytes=%u",
                    session_id,
                    packet_sequence_start,
                    packet_count,
                    batch_pcm_bytes);
            }
        }

        if (stream_failed) {
            if (should_transport_error) {
                esp_err_t error_ret = ble_audio_stream_send_session_error(
                    session_id,
                    packet_sequence_start,
                    session_error_code);
                if (error_ret != ESP_OK) {
                    ESP_LOGW(
                        TAG,
                        "stream session error after transport failure failed: session_id=%" PRIu32 " expected_packet_count=%u error_code=%u ret=%s",
                        session_id,
                        packet_sequence_start,
                        session_error_code,
                        esp_err_to_name(error_ret));
                }
            }
            if (xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
                audio_capture_export_cleanup();
                xSemaphoreGive(s_state_mutex);
            }
            ESP_LOGW(TAG, "record session aborted after BLE transport failure: session_id=%" PRIu32, session_id);
        } else if (should_session_stop) {
            esp_err_t stop_ret = ble_audio_stream_send_session_stop_with_origin(
                session_id,
                expected_packet_count_at_end,
                session_stop_origin);
            if (stop_ret != ESP_OK) {
                ESP_LOGW(
                    TAG,
                    "stream session stop failed: session_id=%" PRIu32 " expected_packet_count=%u ret=%s",
                    session_id,
                    expected_packet_count_at_end,
                    esp_err_to_name(stop_ret));
            } else {
                ESP_LOGI(
                    TAG,
                    "stream session stop queued: session_id=%" PRIu32 " expected_packet_count=%u duration_s=%" PRIu32,
                    session_id,
                    expected_packet_count_at_end,
                    s_export_state.duration_seconds);
            }
        }

        if (!stream_failed && should_emit) {
            uint32_t stop_duration = 0;
            uint32_t stop_frames = 0;
            uint32_t stop_transport_backpressure_events = 0;
            if (xSemaphoreTake(s_state_mutex, portMAX_DELAY) == pdTRUE) {
                stop_duration = s_export_state.duration_seconds;
                stop_frames = s_export_state.captured_frames;
                stop_transport_backpressure_events = s_capture_transport_backpressure_events;
                audio_capture_export_cleanup();
                xSemaphoreGive(s_state_mutex);
            }
            ESP_LOGI(
                TAG,
                "record session capture integrity: session_id=%" PRIu32 " pcm_ms=%" PRIu32 " capture_backpressure_gap_ms=0 capture_backpressure_pause_frames=0 transport_backpressure_events=%" PRIu32,
                session_id,
                stop_frames * AUDIO_CAPTURE_FRAME_MS,
                stop_transport_backpressure_events);
#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
            audio_capture_log_pdm_afe_session_signal(session_id);
#endif
#endif
            diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_SESSION, DIAG_SEV_INFO,
                     2, session_id, stop_duration, stop_frames);
        }
    }
    if (idle_for_logging && (s_frame_captured_count % AUDIO_CAPTURE_LOG_INTERVAL_FRAMES) == 0) {
        ESP_LOGI(
            TAG,
            "frame captured count=%" PRIu32 " bytes=%" PRIu32,
            s_frame_captured_count,
            s_frame_captured_count * (uint32_t)AUDIO_CAPTURE_FRAME_BYTES);
    }
}

