Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
/* ========== SPH0655 PDM hardware path ========== */

#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM

/* A SPH0655 drives one slot according to its soldered SELECT strap. Keep the
 * board configuration deterministic: boot-time ambient noise cannot identify
 * a hardware strap reliably and must never change a device's recording route. */

static int16_t audio_capture_scale_sample_q8(int16_t sample, uint32_t gain_q8)
{
    int32_t scaled =
        ((int32_t)sample * (int32_t)gain_q8) /
        (int32_t)AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_Q8_ONE;
    if (scaled > INT16_MAX) {
        return INT16_MAX;
    }
    if (scaled < INT16_MIN) {
        return INT16_MIN;
    }
    return (int16_t)scaled;
}

static void audio_capture_apply_pdm_software_gain(int16_t *frame_buffer)
{
    if (frame_buffer == NULL ||
        AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_MAX_NUM <= 1U) {
        return;
    }

    uint32_t peak = 0U;
    for (size_t i = 0; i < AUDIO_CAPTURE_FRAME_SAMPLES; i++) {
        int32_t value = frame_buffer[i];
        uint32_t magnitude = (uint32_t)(value < 0 ? -value : value);
        if (magnitude > peak) {
            peak = magnitude;
        }
    }
    uint32_t maximum_gain_q8 =
        AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_MAX_NUM *
        AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_Q8_ONE;
    uint32_t target_gain_q8 = maximum_gain_q8;
    if (peak > 0U) {
        uint64_t peak_limited_gain_q8 =
            ((uint64_t)AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_TARGET_PEAK *
             AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_Q8_ONE) /
            peak;
        if (peak_limited_gain_q8 < target_gain_q8) {
            target_gain_q8 = (uint32_t)peak_limited_gain_q8;
        }
    }
    if (target_gain_q8 < AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_Q8_ONE) {
        target_gain_q8 = AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_Q8_ONE;
    }
    if (target_gain_q8 < s_pdm_pre_afe_gain_q8) {
        s_pdm_pre_afe_gain_q8 = target_gain_q8;
    } else if (target_gain_q8 > s_pdm_pre_afe_gain_q8) {
        uint32_t recovered =
            s_pdm_pre_afe_gain_q8 +
            AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_RECOVERY_Q8;
        s_pdm_pre_afe_gain_q8 = recovered < target_gain_q8
            ? recovered
            : target_gain_q8;
    }
    for (size_t i = 0; i < AUDIO_CAPTURE_FRAME_SAMPLES; i++) {
        frame_buffer[i] = audio_capture_scale_sample_q8(
            frame_buffer[i],
            s_pdm_pre_afe_gain_q8);
    }
}

#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
static void audio_capture_select_pdm_slot(const int16_t *interleaved, int16_t *mono)
{
    for (size_t i = 0; i < AUDIO_CAPTURE_FRAME_SAMPLES; i++) {
        mono[i] = interleaved[(i * 2U) + (size_t)s_pdm_active_buffer_index];
    }
}

#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
static void audio_capture_note_pdm_session_raw_slots(
    const int16_t *interleaved,
    size_t samples_per_slot)
{
    if ((!s_export_state.requested && !s_export_state.active) || interleaved == NULL) {
        return;
    }

    for (size_t index = 0; index < samples_per_slot; index++) {
        int32_t left = interleaved[index * 2U];
        int32_t right = interleaved[(index * 2U) + 1U];
        int32_t delta = left - right;
        if (delta == 0) {
            s_pdm_session_raw_slot_equal_samples++;
        }
        s_pdm_session_raw_slot_delta_abs_sum += (uint32_t)(delta < 0 ? -delta : delta);
        for (size_t slot = 0; slot < 2U; slot++) {
            int32_t value = interleaved[(index * 2U) + slot];
            uint32_t magnitude = (uint32_t)(value < 0 ? -value : value);
            if (magnitude > s_pdm_session_raw_slot_peak[slot]) {
                s_pdm_session_raw_slot_peak[slot] = magnitude;
            }
            s_pdm_session_raw_slot_abs_sum[slot] += magnitude;
        }
    }
    s_pdm_session_raw_slot_samples += samples_per_slot;
}
#endif
#endif

#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
static void audio_capture_log_pdm_afe_level(
    const char *stage,
    uint32_t block_index,
    const int16_t *samples,
    size_t sample_count)
{
    if (block_index == 0U || block_index > 100U || (block_index % 5U) != 0U) {
        return;
    }

    uint32_t peak = 0U;
    uint64_t magnitude_sum = 0U;
    for (size_t index = 0; index < sample_count; index++) {
        int32_t value = samples[index];
        uint32_t magnitude = (uint32_t)(value < 0 ? -value : value);
        if (magnitude > peak) {
            peak = magnitude;
        }
        magnitude_sum += magnitude;
    }

    ESP_LOGI(
        TAG,
        "PDM AFE level: stage=%s block=%" PRIu32 " peak=%" PRIu32 " mean_abs=%" PRIu32,
        stage,
        block_index,
        peak,
        sample_count == 0U ? 0U : (uint32_t)(magnitude_sum / sample_count));
}

static void audio_capture_note_pdm_afe_session_output(
    const int16_t *samples,
    size_t sample_count)
{
    uint32_t peak = 0U;
    uint64_t magnitude_sum = 0U;
    for (size_t index = 0; index < sample_count; index++) {
        int32_t value = samples[index];
        uint32_t magnitude = (uint32_t)(value < 0 ? -value : value);
        if (magnitude > peak) {
            peak = magnitude;
        }
        if (value == INT16_MIN || value == INT16_MAX) {
            s_pdm_afe_session_output_clipped_samples++;
        }
        magnitude_sum += magnitude;
    }
    if (peak > s_pdm_afe_session_output_peak) {
        s_pdm_afe_session_output_peak = peak;
    }
    s_pdm_afe_session_output_abs_sum += magnitude_sum;
    s_pdm_afe_session_output_samples += sample_count;
}

static void audio_capture_note_pdm_afe_session_input(
    const int16_t *samples,
    size_t sample_count)
{
    if ((!s_export_state.requested && !s_export_state.active) || samples == NULL) {
        return;
    }

    uint32_t peak = 0U;
    uint64_t magnitude_sum = 0U;
    for (size_t index = 0; index < sample_count; index++) {
        int32_t value = samples[index];
        uint32_t magnitude = (uint32_t)(value < 0 ? -value : value);
        if (magnitude > peak) {
            peak = magnitude;
        }
        if (value == INT16_MIN || value == INT16_MAX) {
            s_pdm_afe_session_input_clipped_samples++;
        }
        magnitude_sum += magnitude;
    }
    if (peak > s_pdm_afe_session_input_peak) {
        s_pdm_afe_session_input_peak = peak;
    }
    s_pdm_afe_session_input_abs_sum += magnitude_sum;
    s_pdm_afe_session_input_samples += sample_count;
}

