Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
static void audio_capture_note_pdm_afe_session_pre_vad(
    const int16_t *samples,
    size_t sample_count)
{
    if ((!s_export_state.requested && !s_export_state.active) || samples == NULL) {
        return;
    }

    uint32_t peak = 0U;
    uint64_t magnitude_sum = 0U;
    for (size_t index = 0; index < sample_count; index++) {
        int32_t value = samples[index];
        uint32_t magnitude = (uint32_t)(value < 0 ? -value : value);
        if (magnitude > peak) {
            peak = magnitude;
        }
        if (value == INT16_MIN || value == INT16_MAX) {
            s_pdm_afe_session_pre_vad_clipped_samples++;
        }
        magnitude_sum += magnitude;
    }
    if (peak > s_pdm_afe_session_pre_vad_peak) {
        s_pdm_afe_session_pre_vad_peak = peak;
    }
    s_pdm_afe_session_pre_vad_abs_sum += magnitude_sum;
    s_pdm_afe_session_pre_vad_samples += sample_count;
}

static void audio_capture_log_pdm_afe_session_signal(uint32_t session_id)
{
    denzic_audio_leveling_v1_stats_summary_t leveling =
        denzic_audio_leveling_v1_stats_summarize(
            &s_pdm_leveling_session_stats);
    uint32_t input_mean_abs = s_pdm_afe_session_input_samples == 0U
        ? 0U
        : (uint32_t)(s_pdm_afe_session_input_abs_sum / s_pdm_afe_session_input_samples);
    uint32_t pre_vad_mean_abs = s_pdm_afe_session_pre_vad_samples == 0U
        ? 0U
        : (uint32_t)(s_pdm_afe_session_pre_vad_abs_sum /
                     s_pdm_afe_session_pre_vad_samples);
    uint32_t agc_input_mean_abs = s_pdm_afe_session_agc_samples == 0U
        ? 0U
        : (uint32_t)(s_pdm_afe_session_agc_input_abs_sum /
                     s_pdm_afe_session_agc_samples);
    uint32_t agc_output_mean_abs = s_pdm_afe_session_agc_samples == 0U
        ? 0U
        : (uint32_t)(s_pdm_afe_session_agc_output_abs_sum /
                     s_pdm_afe_session_agc_samples);
    uint32_t effective_gain_permille = agc_input_mean_abs == 0U
        ? 0U
        : (uint32_t)(((uint64_t)agc_output_mean_abs * 1000U) /
                     agc_input_mean_abs);
    uint32_t mean_abs = s_pdm_afe_session_output_samples == 0U
        ? 0U
        : (uint32_t)(s_pdm_afe_session_output_abs_sum / s_pdm_afe_session_output_samples);
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
    uint32_t selected_raw_mean_abs = s_pdm_session_raw_slot_samples == 0U
        ? 0U
        : (uint32_t)(s_pdm_session_raw_slot_abs_sum[s_pdm_active_buffer_index] /
                     s_pdm_session_raw_slot_samples);
    uint32_t alternate_raw_mean_abs = s_pdm_session_raw_slot_samples == 0U
        ? 0U
        : (uint32_t)(s_pdm_session_raw_slot_abs_sum[1 - s_pdm_active_buffer_index] /
                     s_pdm_session_raw_slot_samples);
    uint32_t raw_slot_equal_permille = s_pdm_session_raw_slot_samples == 0U
        ? 0U
        : (uint32_t)((s_pdm_session_raw_slot_equal_samples * 1000U) /
                     s_pdm_session_raw_slot_samples);
    uint32_t raw_slot_delta_mean_abs = s_pdm_session_raw_slot_samples == 0U
        ? 0U
        : (uint32_t)(s_pdm_session_raw_slot_delta_abs_sum /
                     s_pdm_session_raw_slot_samples);
#endif
    ESP_LOGI(
        TAG,
        "PDM AFE session signal: session_id=%" PRIu32 " input_peak=%" PRIu32
        " input_mean_abs=%" PRIu32 " input_clipped_samples=%" PRIu64
        " input_clip_ratio_ppm=%" PRIu64
        " pre_vad_peak=%" PRIu32 " pre_vad_mean_abs=%" PRIu32
        " pre_vad_clipped_samples=%" PRIu64
        " agc_input_mean_abs=%" PRIu32 " agc_output_mean_abs=%" PRIu32
        " effective_gain_permille=%" PRIu32
        " pre_afe_gain_permille=%" PRIu32
        " output_frames=%" PRIu32 " output_peak=%" PRIu32
        " output_mean_abs=%" PRIu32 " output_clipped_samples=%" PRIu64
        " output_clip_ratio_ppm=%" PRIu64
        " limiter_input_peak=%" PRIu32 " limited_frames=%" PRIu32
        " limiter_max_reduction_permille=%" PRIu32
        " vad_noise_floor_mean_abs=%" PRIu32
        " vad_low_snr_threshold_mean_abs=%" PRIu32
        " vad_speech_mean_abs=%" PRIu32
        " vad_low_snr_speech_frames=%" PRIu32
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
        " raw_selected_peak=%" PRIu32 " raw_selected_mean_abs=%" PRIu32
        " raw_alternate_peak=%" PRIu32 " raw_alternate_mean_abs=%" PRIu32
        " raw_slot_equal_permille=%" PRIu32 " raw_slot_delta_mean_abs=%" PRIu32
#endif
        " stop_drain_frames=%" PRIu32
        " stop_drain_padding_samples=%u",
        session_id,
        s_pdm_afe_session_input_peak,
        input_mean_abs,
        s_pdm_afe_session_input_clipped_samples,
        s_pdm_afe_session_input_samples == 0U
            ? 0U
            : (s_pdm_afe_session_input_clipped_samples * 1000000U) /
                s_pdm_afe_session_input_samples,
        s_pdm_afe_session_pre_vad_peak,
        pre_vad_mean_abs,
        s_pdm_afe_session_pre_vad_clipped_samples,
        agc_input_mean_abs,
        agc_output_mean_abs,
        effective_gain_permille,
        (uint32_t)(((uint64_t)s_pdm_pre_afe_gain_q8 * 1000U) /
                    AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_Q8_ONE),
        s_pdm_afe_output_frames,
        s_pdm_afe_session_output_peak,
        mean_abs,
        s_pdm_afe_session_output_clipped_samples,
        s_pdm_afe_session_output_samples == 0U
            ? 0U
            : (s_pdm_afe_session_output_clipped_samples * 1000000U) /
                s_pdm_afe_session_output_samples,
        s_pdm_afe_session_limiter_input_peak,
        s_pdm_afe_session_limited_frames,
        s_pdm_afe_session_limiter_max_reduction_permille,
        s_pdm_vad_noise_floor_q8 >> 8U,
        s_pdm_vad_last_diagnostic_threshold,
        s_pdm_vad_last_speech_mean_abs,
        s_pdm_vad_low_snr_speech_frames,
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
        s_pdm_session_raw_slot_peak[s_pdm_active_buffer_index],
        selected_raw_mean_abs,
        s_pdm_session_raw_slot_peak[1 - s_pdm_active_buffer_index],
        alternate_raw_mean_abs,
        raw_slot_equal_permille,
        raw_slot_delta_mean_abs,
#endif
        s_pdm_afe_stop_drain_output_frames,
        (unsigned)s_pdm_afe_stop_drain_padding_samples);
    ESP_LOGI(
        TAG,
        "PDM audio leveling paired stats: session_id=%" PRIu32
        " frames=%" PRIu32 " voiced_frames=%" PRIu32
        " raw_p10_p50_p90=%" PRIu32 "/%" PRIu32 "/%" PRIu32
        " post_agc_p10_p50_p90=%" PRIu32 "/%" PRIu32 "/%" PRIu32
        " gain_permille_p10_p50_p90=%" PRIu32 "/%" PRIu32 "/%" PRIu32
        " voiced_raw_p10_p50_p90=%" PRIu32 "/%" PRIu32 "/%" PRIu32
        " voiced_post_agc_p10_p50_p90=%" PRIu32 "/%" PRIu32 "/%" PRIu32
        " voiced_gain_permille_p10_p50_p90=%" PRIu32 "/%" PRIu32 "/%" PRIu32
        " noise_floor_mean_abs=%" PRIu32
        " allowed_gain_permille=%" PRIu32
        " gain_limited_frames=%" PRIu32
        " gain_ceiling_frames=%" PRIu32
        " limiter_frames=%" PRIu32 " clipped_samples=%" PRIu64,
        session_id,
        leveling.frames,
        leveling.voiced_frames,
        leveling.raw_mean_abs_p10,
        leveling.raw_mean_abs_p50,
        leveling.raw_mean_abs_p90,
        leveling.post_agc_mean_abs_p10,
        leveling.post_agc_mean_abs_p50,
        leveling.post_agc_mean_abs_p90,
        leveling.effective_gain_permille_p10,
        leveling.effective_gain_permille_p50,
        leveling.effective_gain_permille_p90,
        leveling.voiced_raw_mean_abs_p10,
        leveling.voiced_raw_mean_abs_p50,
        leveling.voiced_raw_mean_abs_p90,
        leveling.voiced_post_agc_mean_abs_p10,
        leveling.voiced_post_agc_mean_abs_p50,
        leveling.voiced_post_agc_mean_abs_p90,
        leveling.voiced_effective_gain_permille_p10,
        leveling.voiced_effective_gain_permille_p50,
        leveling.voiced_effective_gain_permille_p90,
        s_pdm_leveling_last_noise_floor_mean_abs,
        s_pdm_leveling_last_allowed_gain_permille,
        leveling.gain_limited_frames,
        leveling.gain_ceiling_frames,
        leveling.limiter_frames,
        leveling.clipped_samples);
    /* Persist the three signal points that determine model input quality.
     * LED brightness is derived from the raw capture frame and cannot stand in
     * for the AFE/AGC/leveling output actually transported to Type. */
    diag_log(
        DIAG_SRC_AUDIO,
        DIAG_AUDIO_SIGNAL_PATH,
        DIAG_SEV_INFO,
        session_id,
        input_mean_abs,
        agc_output_mean_abs,
        mean_abs);
    diag_log(
        DIAG_SRC_AUDIO,
        DIAG_AUDIO_LEVELING,
        DIAG_SEV_INFO,
        session_id,
        s_pdm_leveling_last_noise_floor_mean_abs,
        s_pdm_leveling_last_allowed_gain_permille,
        leveling.gain_limited_frames);
}

static void audio_capture_pdm_afe_emit(const int16_t *samples, size_t sample_count)
{
    while (sample_count > 0) {
        size_t remaining = AUDIO_CAPTURE_FRAME_SAMPLES - s_pdm_afe_emit_filled;
        size_t copied = sample_count < remaining ? sample_count : remaining;
        memcpy(
            s_pdm_afe_emit_buffer + s_pdm_afe_emit_filled,
            samples,
            copied * sizeof(*samples));
        s_pdm_afe_emit_filled += copied;
        samples += copied;
        sample_count -= copied;

        if (s_pdm_afe_emit_filled == AUDIO_CAPTURE_FRAME_SAMPLES) {
            if (s_pdm_afe_output_frames == 0U) {
                ESP_LOGI(
                    TAG,
                    "PDM AFE first enhanced frame: feed_blocks=%" PRIu32,
                    s_pdm_afe_input_frames);
            }
            audio_capture_log_pdm_afe_level(
                "output",
                s_pdm_afe_output_frames + 1U,
                s_pdm_afe_emit_buffer,
                AUDIO_CAPTURE_FRAME_SAMPLES);
            audio_capture_note_pdm_afe_session_output(
                s_pdm_afe_emit_buffer,
                AUDIO_CAPTURE_FRAME_SAMPLES);
            audio_capture_process_frame(s_pdm_afe_emit_buffer);
            if (s_pdm_afe_session_boundary_applied &&
                s_pdm_afe_input_frames >=
                    AUDIO_CAPTURE_PDM_SESSION_WARMUP_MIN_FEED_BLOCKS) {
                s_pdm_afe_session_warmup_ready = true;
            }
            if (s_pdm_afe_stop_drain_requested && !s_pdm_afe_stop_drain_complete) {
                s_pdm_afe_stop_drain_output_frames++;
            }
            s_pdm_afe_emit_filled = 0;
            s_pdm_afe_output_frames++;
        }
    }
}

static bool audio_capture_pdm_apply_final_limiter(
    int16_t *samples,
    size_t sample_count);

static uint32_t audio_capture_pdm_mean_abs(
    const int16_t *samples,
    size_t sample_count)
{
    if (samples == NULL || sample_count == 0U) {
        return 0U;
    }
    uint64_t sum = 0U;
    for (size_t index = 0; index < sample_count; index++) {
        int32_t value = samples[index];
        sum += (uint32_t)(value < 0 ? -value : value);
    }
    return (uint32_t)(sum / sample_count);
}

static void audio_capture_pdm_agc_emit_frame(void)
{
    int ret = esp_agc_process(
        s_pdm_agc_handle,
        s_pdm_agc_input_buffer,
        s_pdm_agc_output_buffer,
        AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES,
        AUDIO_CAPTURE_SAMPLE_RATE_HZ);
    if (ret != ESP_AGC_SUCCESS) {
        ESP_LOGW(TAG, "PDM post-VAD AGC process failed: ret=%d", ret);
        memcpy(
            s_pdm_agc_output_buffer,
            s_pdm_agc_input_buffer,
            sizeof(s_pdm_agc_output_buffer));
    }
    bool session_observed =
        s_export_state.requested || s_export_state.active;
    uint32_t session_id = s_export_state.session_id;
    if (session_observed &&
        s_pdm_leveling_stats_session_id != session_id) {
        denzic_audio_leveling_v1_stats_reset(
            &s_pdm_leveling_session_stats);
        s_pdm_leveling_stats_session_id = session_id;
    }
    if (session_observed) {
        for (size_t index = 0;
             index < AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES;
             index++) {
            int32_t input = s_pdm_agc_input_buffer[index];
            int32_t output = s_pdm_agc_output_buffer[index];
            s_pdm_afe_session_agc_input_abs_sum +=
                (uint32_t)(input < 0 ? -input : input);
            s_pdm_afe_session_agc_output_abs_sum +=
                (uint32_t)(output < 0 ? -output : output);
        }
        s_pdm_afe_session_agc_samples +=
            AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES;
    }
    denzic_audio_leveling_v1_input_t leveling_input = {
        .raw_mean_abs = audio_capture_pdm_mean_abs(
            s_pdm_agc_input_buffer,
            AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES),
        .post_agc_mean_abs = audio_capture_pdm_mean_abs(
            s_pdm_agc_output_buffer,
            AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES),
        .elapsed_ms = AUDIO_CAPTURE_PDM_AGC_FRAME_MS,
        .speech_detected = s_pdm_leveling_speech_detected,
    };
    denzic_audio_leveling_v1_output_t leveling_output =
        denzic_audio_leveling_v1_step(
            &s_pdm_leveling_state,
            &s_pdm_leveling_config,
            leveling_input);
    s_pdm_leveling_last_noise_floor_mean_abs =
        leveling_output.noise_floor_mean_abs;
    s_pdm_leveling_last_allowed_gain_permille =
        leveling_output.allowed_gain_permille;
    if (leveling_output.scale_permille <
        DENZIC_AUDIO_V1_LEVELING_SCALE_ONE_PERMILLE) {
        for (size_t index = 0;
             index < AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES;
             index++) {
            int32_t scaled =
                ((int32_t)s_pdm_agc_output_buffer[index] *
                 (int32_t)leveling_output.scale_permille) /
                (int32_t)DENZIC_AUDIO_V1_LEVELING_SCALE_ONE_PERMILLE;
            s_pdm_agc_output_buffer[index] = (int16_t)scaled;
        }
    }
    uint32_t clipped_samples = 0U;
    for (size_t index = 0;
         index < AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES;
         index++) {
        if (s_pdm_agc_output_buffer[index] == INT16_MIN ||
            s_pdm_agc_output_buffer[index] == INT16_MAX) {
            clipped_samples++;
        }
    }
    bool limiter_applied = audio_capture_pdm_apply_final_limiter(
        s_pdm_agc_output_buffer,
        AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES);
    if (session_observed) {
        denzic_audio_leveling_v1_stats_observe(
            &s_pdm_leveling_session_stats,
            leveling_input,
            leveling_output,
            limiter_applied,
            clipped_samples);
    }
    audio_capture_pdm_afe_emit(
        s_pdm_agc_output_buffer,
        AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES);
}

