Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
static void audio_capture_pdm_agc_process(
    const int16_t *samples,
    size_t sample_count)
{
    while (sample_count > 0U) {
        size_t remaining =
            AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES - s_pdm_agc_filled;
        size_t copied = sample_count < remaining ? sample_count : remaining;
        memcpy(
            s_pdm_agc_input_buffer + s_pdm_agc_filled,
            samples,
            copied * sizeof(*samples));
        s_pdm_agc_filled += copied;
        samples += copied;
        sample_count -= copied;

        if (s_pdm_agc_filled == AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES) {
            audio_capture_pdm_agc_emit_frame();
            s_pdm_agc_filled = 0U;
        }
    }
}

static size_t audio_capture_pdm_agc_flush_partial(void)
{
    if (s_pdm_agc_filled == 0U) {
        return 0U;
    }

    size_t padding_samples =
        AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES - s_pdm_agc_filled;
    memset(
        s_pdm_agc_input_buffer + s_pdm_agc_filled,
        0,
        padding_samples * sizeof(*s_pdm_agc_input_buffer));
    s_pdm_agc_filled = AUDIO_CAPTURE_PDM_AGC_FRAME_SAMPLES;
    audio_capture_pdm_agc_emit_frame();
    s_pdm_agc_filled = 0U;
    return padding_samples;
}

static bool audio_capture_pdm_apply_final_limiter(
    int16_t *samples,
    size_t sample_count)
{
    uint32_t peak = 0U;
    for (size_t index = 0; index < sample_count; index++) {
        int32_t value = samples[index];
        uint32_t magnitude = (uint32_t)(value < 0 ? -value : value);
        if (magnitude > peak) {
            peak = magnitude;
        }
    }
    if (peak > s_pdm_afe_session_limiter_input_peak) {
        s_pdm_afe_session_limiter_input_peak = peak;
    }
    if (peak <= AUDIO_CAPTURE_PDM_LIMITER_CEILING) {
        return false;
    }

    uint32_t scale_q15 =
        ((uint32_t)AUDIO_CAPTURE_PDM_LIMITER_CEILING << 15U) / peak;
    uint32_t reduction_permille =
        1000U - ((scale_q15 * 1000U) / AUDIO_CAPTURE_PDM_LIMITER_Q15_ONE);
    if (reduction_permille >
        s_pdm_afe_session_limiter_max_reduction_permille) {
        s_pdm_afe_session_limiter_max_reduction_permille =
            reduction_permille;
    }
    s_pdm_afe_session_limited_frames++;
    for (size_t index = 0; index < sample_count; index++) {
        int32_t scaled = ((int32_t)samples[index] * (int32_t)scale_q15) /
            (int32_t)AUDIO_CAPTURE_PDM_LIMITER_Q15_ONE;
        samples[index] = (int16_t)scaled;
    }
    return true;
}

static void audio_capture_pdm_afe_complete_stop_drain(void)
{
    if (!s_pdm_afe_stop_drain_requested || !s_pdm_afe_stop_drain_feed_cutoff_ack ||
        s_pdm_afe_stop_drain_complete) {
        return;
    }

    s_pdm_afe_stop_drain_padding_samples +=
        audio_capture_pdm_agc_flush_partial();
    if (s_pdm_afe_emit_filled > 0U) {
        int16_t silence[AUDIO_CAPTURE_FRAME_SAMPLES] = {0};
        size_t padding_samples = AUDIO_CAPTURE_FRAME_SAMPLES - s_pdm_afe_emit_filled;
        s_pdm_afe_stop_drain_padding_samples += padding_samples;
        audio_capture_pdm_afe_emit(silence, padding_samples);
    }

    s_pdm_afe_stop_drain_complete = true;
    int16_t boundary_frame[AUDIO_CAPTURE_FRAME_SAMPLES] = {0};
    audio_capture_process_frame(boundary_frame);
}

static void audio_capture_pdm_vad_process(
    vad_state_t state,
    const int16_t *samples,
    size_t sample_count)
{
    s_pdm_leveling_speech_detected = state == VAD_SPEECH;
    if ((!s_voice_activation_monitoring &&
         !audio_capture_session_is_active()) ||
        samples == NULL ||
        sample_count == 0u) {
        return;
    }

    uint64_t magnitude_sum = 0U;
    for (size_t index = 0; index < sample_count; index++) {
        int32_t value = samples[index];
        magnitude_sum += (uint32_t)(value < 0 ? -value : value);
    }
    uint32_t mean_abs = (uint32_t)(magnitude_sum / sample_count);
    uint32_t noise_floor =
        s_pdm_vad_noise_floor_q8 >> 8U;
    if (noise_floor < AUDIO_CAPTURE_PDM_VAD_NOISE_MIN_MEAN_ABS) {
        noise_floor = AUDIO_CAPTURE_PDM_VAD_NOISE_MIN_MEAN_ABS;
    }
    uint32_t ratio_threshold =
        (noise_floor * AUDIO_CAPTURE_PDM_VAD_LOW_SNR_NUMERATOR +
         AUDIO_CAPTURE_PDM_VAD_LOW_SNR_DENOMINATOR - 1U) /
        AUDIO_CAPTURE_PDM_VAD_LOW_SNR_DENOMINATOR;
    uint32_t margin_threshold =
        noise_floor + AUDIO_CAPTURE_PDM_VAD_LOW_SNR_MIN_MARGIN;
    uint32_t diagnostic_threshold =
        ratio_threshold > margin_threshold
            ? ratio_threshold
            : margin_threshold;
    s_pdm_vad_last_diagnostic_threshold = diagnostic_threshold;

    bool session_active = audio_capture_session_is_active();
    bool speech_detected = state == VAD_SPEECH;
    if (!session_active && speech_detected) {
        s_pdm_vad_last_speech_mean_abs = mean_abs;
        if (mean_abs < diagnostic_threshold) {
            s_pdm_vad_low_snr_speech_frames++;
            if (s_pdm_vad_low_snr_speech_frames <= 4U ||
                (s_pdm_vad_low_snr_speech_frames % 32U) == 0U) {
                ESP_LOGI(
                    TAG,
                    "PDM VAD low-SNR speech preserved:"
                    " mean_abs=%" PRIu32 " noise_floor=%" PRIu32
                    " diagnostic_threshold=%" PRIu32
                    " low_snr_speech_frames=%" PRIu32,
                    mean_abs,
                    noise_floor,
                    diagnostic_threshold,
                    s_pdm_vad_low_snr_speech_frames);
            }
        }
    }

    /* VADNet is the candidate authority. Level/SNR is diagnostic only: an
     * extra amplitude veto loses quiet speech when construction noise raises
     * the baseline. Learn the baseline exclusively from VADNet non-speech so
     * a low-SNR speech frame can never self-strengthen a future veto. */
    if (!session_active && state != VAD_SPEECH) {
        uint32_t target_q8 = mean_abs << 8U;
        int32_t delta =
            (int32_t)target_q8 - (int32_t)s_pdm_vad_noise_floor_q8;
        int32_t step = delta / (int32_t)(1U << AUDIO_CAPTURE_PDM_VAD_NOISE_EWMA_SHIFT);
        if (step == 0 && delta != 0) {
            step = delta > 0 ? 1 : -1;
        }
        int32_t updated = (int32_t)s_pdm_vad_noise_floor_q8 + step;
        int32_t minimum =
            (int32_t)(AUDIO_CAPTURE_PDM_VAD_NOISE_MIN_MEAN_ABS << 8U);
        s_pdm_vad_noise_floor_q8 =
            (uint32_t)(updated > minimum ? updated : minimum);
    }

    audio_capture_voice_activity_handler_t handler =
        s_voice_activity_handler;
    if (handler != NULL) {
        uint32_t elapsed_ms =
            (uint32_t)((sample_count * 1000u) / AUDIO_CAPTURE_SAMPLE_RATE_HZ);
        handler(speech_detected, elapsed_ms);
    }
}

/* ESP-SR requires its feed and fetch calls to run concurrently. Keep this
 * task separate from I2S capture; serializing them stalls feed and leaves the
 * user with a recording state that never emits PCM. */
static void audio_capture_pdm_afe_fetch_task(void *arg)
{
    (void)arg;
    (void)watchdog_platform_subscribe_current_task("audio_afe_fetch_task");
    int64_t scheduler_budget_started_us = esp_timer_get_time();

    while (true) {
        watchdog_platform_feed_current_task();
        /* I2S is deliberately stopped in idle power save. Do not poll the AFE
         * without an input producer: its empty-ring-buffer warning is both
         * misleading and unnecessary work. audio_capture_wake_task() wakes
         * this fetch task together with capture when a session starts. */
        if (s_idle_power_save_requested && !audio_capture_session_is_active()) {
            (void)watchdog_platform_task_notify_take_low_power(
                pdTRUE,
                AUDIO_CAPTURE_IDLE_POWER_SAVE_WAIT_MS);
            scheduler_budget_started_us = esp_timer_get_time();
            continue;
        }
        size_t sample_count = 0;
        afe_fetch_result_t *result =
            s_pdm_afe_handle->fetch_with_delay(
                s_pdm_afe_data,
                pdMS_TO_TICKS(AUDIO_CAPTURE_PDM_AFE_FETCH_WAIT_MS));
        if (result == NULL || result->ret_value != ESP_OK) {
            audio_capture_pdm_afe_complete_stop_drain();
            audio_capture_yield_if_over_budget(&scheduler_budget_started_us);
            continue;
        }
        if (!s_pdm_afe_session_boundary_requested && result->data != NULL && result->data_size > 0) {
            sample_count = (size_t)result->data_size / sizeof(*result->data);
            if (sample_count <= s_pdm_afe_fetch_samples) {
                memcpy(
                    s_pdm_afe_fetch_buffer,
                    result->data,
                    sample_count * sizeof(*result->data));
            } else {
                ESP_LOGW(
                    TAG,
                    "PDM AFE fetch frame too large: samples=%u capacity=%u",
                    (unsigned)sample_count,
                    (unsigned)s_pdm_afe_fetch_samples);
                sample_count = 0;
            }
        }
        if (sample_count > 0) {
            /* VADNet classifies unboosted post-NS audio. Only accepted AFE
             * output then reaches the one adaptive AGC and final limiter. */
            audio_capture_pdm_vad_process(
                result->vad_state,
                s_pdm_afe_fetch_buffer,
                sample_count);
            audio_capture_pdm_agc_process(
                s_pdm_afe_fetch_buffer,
                sample_count);
        }
        /* VADNet can keep the fetch queue continuously runnable under
         * sustained noise. Use the same time budget as the I2S producer so an
         * error/empty result and a normal burst have identical scheduler
         * behavior; the 240 ms AFE ring absorbs the one-tick yield. */
        audio_capture_yield_if_over_budget(&scheduler_budget_started_us);
    }
}

