Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
static esp_err_t audio_capture_pdm_afe_init(void)
{
    extern const uint8_t _binary_listener_vadnet1_medium_bin_start[];
    extern const uint8_t _binary_listener_vadnet1_medium_bin_end[];
    const size_t embedded_model_bytes =
        (size_t)(_binary_listener_vadnet1_medium_bin_end -
                 _binary_listener_vadnet1_medium_bin_start);
    s_pdm_srmodels = srmodel_load(
        _binary_listener_vadnet1_medium_bin_start);
    char *vad_model_name =
        esp_srmodel_filter(s_pdm_srmodels, "vadnet1_medium", NULL);
    if (vad_model_name == NULL) {
        ESP_LOGE(
            TAG,
            "PDM embedded VADNet model unavailable: bytes=%u",
            (unsigned)embedded_model_bytes);
        return ESP_ERR_NOT_FOUND;
    }

    afe_config_t *config =
        afe_config_init("M", s_pdm_srmodels, AFE_TYPE_VC, AFE_MODE_HIGH_PERF);
    if (config == NULL) {
        ESP_LOGE(TAG, "PDM AFE config allocation failed");
        return ESP_ERR_NO_MEM;
    }

    /* The PDM board has one microphone and no playback reference. Use the
     * official neural VAD in the same post-NS AFE pipeline so weak speech does
     * not depend on the old absolute-level-biased WebRTC classifier. */
    config->aec_init = false;
    config->se_init = false;
    config->ns_init = true;
    config->ns_model_name = NULL;
    config->afe_ns_mode = AFE_NS_MODE_WEBRTC;
    config->vad_init = true;
    config->vad_model_name = vad_model_name;
    config->vad_mode = VAD_MODE_1;
    config->vad_min_speech_ms = AUDIO_CAPTURE_PDM_VAD_MIN_SPEECH_MS;
    config->vad_min_noise_ms = AUDIO_CAPTURE_PDM_VAD_MIN_NOISE_MS;
    config->vad_delay_ms = AUDIO_CAPTURE_PDM_VAD_DELAY_MS;
    config->wakenet_init = false;
    /* The one firmware AGC runs after VADNet. Do not stack AFE's independent
     * AGC on top or promote stationary room noise into automatic sessions. */
    config->agc_init = false;
    config->afe_ringbuf_size = AUDIO_CAPTURE_PDM_AFE_RINGBUF_FRAMES;
    config->memory_alloc_mode = AFE_MEMORY_ALLOC_MORE_PSRAM;
    /* Preserve the post-NS waveform. A fixed 12 dB lift can clip ordinary
     * microphone peaks before Type has a chance to calibrate the session. */
    config->afe_linear_gain = 1.0f;
    config->fixed_first_channel = true;
    config->fixed_output_channel = true;
    config = afe_config_check(config);
    if (config == NULL) {
        ESP_LOGE(TAG, "PDM AFE config rejected");
        return ESP_FAIL;
    }

    const float linear_gain = config->afe_linear_gain;
    s_pdm_afe_handle = esp_afe_handle_from_config(config);
    if (s_pdm_afe_handle == NULL) {
        ESP_LOGE(TAG, "PDM AFE handle unavailable");
        afe_config_free(config);
        return ESP_FAIL;
    }

    s_pdm_afe_data = s_pdm_afe_handle->create_from_config(config);
    afe_config_free(config);
    if (s_pdm_afe_data == NULL) {
        ESP_LOGE(TAG, "PDM AFE instance creation failed");
        s_pdm_afe_handle = NULL;
        return ESP_FAIL;
    }

    int feed_samples = s_pdm_afe_handle->get_feed_chunksize(s_pdm_afe_data);
    int fetch_samples = s_pdm_afe_handle->get_fetch_chunksize(s_pdm_afe_data);
    if (feed_samples <= 0 || fetch_samples <= 0) {
        ESP_LOGE(TAG, "PDM AFE invalid frame geometry: feed=%d fetch=%d", feed_samples, fetch_samples);
        s_pdm_afe_handle->destroy(s_pdm_afe_data);
        s_pdm_afe_data = NULL;
        s_pdm_afe_handle = NULL;
        return ESP_FAIL;
    }

    s_pdm_afe_feed_buffer = calloc((size_t)feed_samples, sizeof(*s_pdm_afe_feed_buffer));
    s_pdm_afe_fetch_buffer = calloc((size_t)fetch_samples, sizeof(*s_pdm_afe_fetch_buffer));
    if (s_pdm_afe_feed_buffer == NULL || s_pdm_afe_fetch_buffer == NULL) {
        ESP_LOGE(TAG, "PDM AFE buffer allocation failed: feed=%d fetch=%d", feed_samples, fetch_samples);
        free(s_pdm_afe_feed_buffer);
        free(s_pdm_afe_fetch_buffer);
        s_pdm_afe_feed_buffer = NULL;
        s_pdm_afe_fetch_buffer = NULL;
        s_pdm_afe_handle->destroy(s_pdm_afe_data);
        s_pdm_afe_data = NULL;
        s_pdm_afe_handle = NULL;
        return ESP_ERR_NO_MEM;
    }

    s_pdm_afe_feed_samples = (size_t)feed_samples;
    s_pdm_afe_fetch_samples = (size_t)fetch_samples;
    s_pdm_agc_handle = esp_agc_open(AGC_MODE_2, AUDIO_CAPTURE_SAMPLE_RATE_HZ);
    if (s_pdm_agc_handle == NULL) {
        ESP_LOGE(TAG, "PDM standalone AGC allocation failed");
        free(s_pdm_afe_feed_buffer);
        free(s_pdm_afe_fetch_buffer);
        s_pdm_afe_feed_buffer = NULL;
        s_pdm_afe_fetch_buffer = NULL;
        s_pdm_afe_handle->destroy(s_pdm_afe_data);
        s_pdm_afe_data = NULL;
        s_pdm_afe_handle = NULL;
        return ESP_ERR_NO_MEM;
    }
    set_agc_config(
        s_pdm_agc_handle,
        AUDIO_CAPTURE_PDM_AGC_COMPRESSION_DB,
        1,
        AUDIO_CAPTURE_PDM_AGC_TARGET_DBFS);
    s_pdm_leveling_config = denzic_audio_leveling_v1_default_config();
    denzic_audio_leveling_v1_reset(
        &s_pdm_leveling_state,
        &s_pdm_leveling_config);
    denzic_audio_leveling_v1_stats_reset(&s_pdm_leveling_session_stats);
    s_pdm_leveling_last_noise_floor_mean_abs =
        s_pdm_leveling_config.initial_noise_floor_mean_abs;
    s_pdm_leveling_last_allowed_gain_permille =
        s_pdm_leveling_config.maximum_effective_gain_permille;
    /* Audio task stacks stay internal: they are hot paths and must remain valid
     * while the Flash cache is disabled. The task-owned pre-roll history uses
     * PSRAM instead. */
    BaseType_t task_ok = xTaskCreatePinnedToCore(
        audio_capture_pdm_afe_fetch_task,
        "audio_afe_fetch",
        AUDIO_CAPTURE_TASK_STACK_BYTES,
        NULL,
        /* Match I2S capture priority on the other core so every feed block is
         * consumed before the AFE ring can overwrite audio. */
        AUDIO_CAPTURE_AFE_FETCH_TASK_PRIORITY,
        &s_pdm_afe_fetch_task_handle,
        AUDIO_CAPTURE_AFE_FETCH_TASK_CORE);
    if (task_ok != pdPASS) {
        ESP_LOGE(TAG, "PDM AFE fetch task creation failed");
        esp_agc_close(s_pdm_agc_handle);
        s_pdm_agc_handle = NULL;
        free(s_pdm_afe_feed_buffer);
        free(s_pdm_afe_fetch_buffer);
        s_pdm_afe_feed_buffer = NULL;
        s_pdm_afe_fetch_buffer = NULL;
        s_pdm_afe_handle->destroy(s_pdm_afe_data);
        s_pdm_afe_data = NULL;
        s_pdm_afe_handle = NULL;
        return ESP_ERR_NO_MEM;
    }

    s_pdm_afe_handle->print_pipeline(s_pdm_afe_data);
    ESP_LOGI(
        TAG,
        "PDM AFE ready: pipeline=continuous-webrtc-ns-vadnet-agc-gain-governor-limiter"
        " vad=vadnet1-medium mode=1 vad_min_speech_ms=%u"
        " vad_min_noise_ms=%u vad_delay_ms=%u model_bytes=%u"
        " post_vad_agc_mode=digital agc_frame_ms=%u"
        " agc_compression_db=%d agc_target_dbfs=-%d limiter=1"
        " leveling_max_gain_permille=%" PRIu32
        " leveling_noise_output_mean_abs=%" PRIu32
        " leveling_hold_ms=%" PRIu32
        " leveling_attack_ms=%" PRIu32
        " leveling_release_ms=%" PRIu32
        " final_limiter_ceiling=%d"
        " linear_gain=%.1f feed_samples=%d fetch_samples=%d"
        " ringbuf_frames=%u fetch_wait_ms=%u"
        " feed_core=%d feed_prio=5 fetch_core=%d fetch_prio=%u",
        (unsigned)AUDIO_CAPTURE_PDM_VAD_MIN_SPEECH_MS,
        (unsigned)AUDIO_CAPTURE_PDM_VAD_MIN_NOISE_MS,
        (unsigned)AUDIO_CAPTURE_PDM_VAD_DELAY_MS,
        (unsigned)embedded_model_bytes,
        (unsigned)AUDIO_CAPTURE_PDM_AGC_FRAME_MS,
        AUDIO_CAPTURE_PDM_AGC_COMPRESSION_DB,
        AUDIO_CAPTURE_PDM_AGC_TARGET_DBFS,
        s_pdm_leveling_config.maximum_effective_gain_permille,
        s_pdm_leveling_config.maximum_noise_output_mean_abs,
        s_pdm_leveling_config.speech_hold_ms,
        s_pdm_leveling_config.attenuation_attack_ms,
        s_pdm_leveling_config.attenuation_release_ms,
        AUDIO_CAPTURE_PDM_LIMITER_CEILING,
        (double)linear_gain,
        feed_samples,
        fetch_samples,
        (unsigned)AUDIO_CAPTURE_PDM_AFE_RINGBUF_FRAMES,
        (unsigned)AUDIO_CAPTURE_PDM_AFE_FETCH_WAIT_MS,
        AUDIO_CAPTURE_TASK_CORE,
        AUDIO_CAPTURE_AFE_FETCH_TASK_CORE,
        (unsigned)AUDIO_CAPTURE_AFE_FETCH_TASK_PRIORITY);
    return ESP_OK;
}

