Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
static void audio_capture_pdm_afe_apply_session_boundary_if_requested(void)
{
    if (!s_pdm_afe_session_boundary_requested) {
        return;
    }

    s_pdm_afe_feed_filled = 0;
    s_pdm_agc_filled = 0;
    s_pdm_afe_emit_filled = 0;
    s_pdm_afe_input_frames = 0;
    s_pdm_afe_output_frames = 0;
    s_pdm_afe_session_output_peak = 0;
    s_pdm_afe_session_output_abs_sum = 0;
    s_pdm_afe_session_output_samples = 0;
    s_pdm_afe_session_output_clipped_samples = 0;
    s_pdm_afe_session_boundary_applied = true;
    s_pdm_afe_session_boundary_requested = false;
    ESP_LOGI(
        TAG,
        "PDM AFE session boundary: cleared partial PCM, preserving trained NS/AGC state");
}

static void audio_capture_pdm_afe_process(int16_t *frame_buffer)
{
    audio_capture_pdm_afe_apply_session_boundary_if_requested();

    if (s_pdm_afe_stop_drain_requested) {
        /* The capture task has observed the stop edge. It must not feed post-stop
         * input, while the fetch task drains enhanced output already in the AFE. */
        s_pdm_afe_stop_drain_feed_cutoff_ack = true;
        return;
    }

    audio_capture_note_pdm_afe_session_input(frame_buffer, AUDIO_CAPTURE_FRAME_SAMPLES);
    audio_capture_note_pdm_afe_session_pre_vad(
        frame_buffer,
        AUDIO_CAPTURE_FRAME_SAMPLES);

    size_t remaining = AUDIO_CAPTURE_FRAME_SAMPLES;
    const int16_t *cursor = frame_buffer;
    while (remaining > 0) {
        size_t capacity = s_pdm_afe_feed_samples - s_pdm_afe_feed_filled;
        size_t copied = remaining < capacity ? remaining : capacity;
        memcpy(
            s_pdm_afe_feed_buffer + s_pdm_afe_feed_filled,
            cursor,
            copied * sizeof(*cursor));
        s_pdm_afe_feed_filled += copied;
        cursor += copied;
        remaining -= copied;

        if (s_pdm_afe_feed_filled == s_pdm_afe_feed_samples) {
            int ret = s_pdm_afe_handle->feed(s_pdm_afe_data, s_pdm_afe_feed_buffer);
            if (ret < 0) {
                ESP_LOGW(TAG, "PDM AFE feed failed: ret=%d", ret);
            }
            s_pdm_afe_feed_filled = 0;
            s_pdm_afe_input_frames++;
            audio_capture_log_pdm_afe_level(
                "pre-vad",
                s_pdm_afe_input_frames,
                s_pdm_afe_feed_buffer,
                s_pdm_afe_feed_samples);
        }
    }
}
#endif

static void audio_capture_task(void *arg)
{
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
    int16_t interleaved_frame_buffer[AUDIO_CAPTURE_FRAME_SAMPLES * 2U];
#endif
    int16_t frame_buffer[AUDIO_CAPTURE_FRAME_SAMPLES];
    int64_t scheduler_budget_started_us = esp_timer_get_time();
    (void)watchdog_platform_subscribe_current_task("audio_capture_task");

    while (1) {
        watchdog_platform_feed_current_task();
        if (s_idle_power_save_requested && !audio_capture_session_is_active()) {
            (void)audio_capture_apply_idle_power_save(true);
            (void)watchdog_platform_task_notify_take_low_power(
                pdTRUE,
                AUDIO_CAPTURE_IDLE_POWER_SAVE_WAIT_MS);
            continue;
        }
        (void)audio_capture_apply_idle_power_save(false);

        audio_capture_note_transport_backpressure();
        size_t bytes_read = 0;
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
        esp_err_t ret = i2s_channel_read(
            s_i2s_rx_handle, interleaved_frame_buffer, sizeof(interleaved_frame_buffer),
            &bytes_read, AUDIO_CAPTURE_I2S_READ_TIMEOUT_MS);
#else
        esp_err_t ret = i2s_channel_read(
            s_i2s_rx_handle, frame_buffer, sizeof(frame_buffer),
            &bytes_read, AUDIO_CAPTURE_I2S_READ_TIMEOUT_MS);
#endif
        if (ret == ESP_OK && bytes_read == sizeof(
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
                interleaved_frame_buffer
#else
                frame_buffer
#endif
            )) {
            audio_capture_note_transport_backpressure();
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
 #if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
            audio_capture_note_pdm_session_raw_slots(
                interleaved_frame_buffer,
                AUDIO_CAPTURE_FRAME_SAMPLES);
 #endif
            audio_capture_select_pdm_slot(interleaved_frame_buffer, frame_buffer);
#endif
            audio_capture_update_recording_level_from_raw_input(frame_buffer);
            audio_capture_apply_pdm_software_gain(frame_buffer);
#if CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
            audio_capture_pdm_afe_process(frame_buffer);
#else
            audio_capture_process_frame(frame_buffer);
#endif
            audio_capture_yield_if_over_budget(&scheduler_budget_started_us);
            continue;
        }

        if (ret == ESP_ERR_TIMEOUT) {
            /*
             * A missing DMA event must not strand this watchdog-subscribed
             * task in an infinite wait. Restart the already-configured RX
             * channel in place so an active recording resumes after a bounded
             * gap instead of rebooting the entire device.
             */
            s_dropped_frame_count++;
            s_i2s_stall_recovery_count++;
            esp_err_t disable_ret = i2s_channel_disable(s_i2s_rx_handle);
            esp_err_t enable_ret = disable_ret == ESP_OK
                ? i2s_channel_enable(s_i2s_rx_handle)
                : disable_ret;
            ESP_LOGW(
                TAG,
                "PDM I2S stall recovery: count=%" PRIu32
                " dropped=%" PRIu32 " disable=%s enable=%s",
                s_i2s_stall_recovery_count,
                s_dropped_frame_count,
                esp_err_to_name(disable_ret),
                esp_err_to_name(enable_ret));
            diag_log(
                DIAG_SRC_AUDIO,
                DIAG_AUDIO_I2S_FAIL,
                enable_ret == ESP_OK ? DIAG_SEV_WARN : DIAG_SEV_ERROR,
                s_dropped_frame_count,
                ESP_ERR_TIMEOUT,
                s_i2s_stall_recovery_count,
                (uint32_t)enable_ret);
            audio_capture_yield_if_over_budget(&scheduler_budget_started_us);
            vTaskDelay(1);
            continue;
        }
        if (ret != ESP_OK) {
            s_dropped_frame_count++;
            ESP_LOGW(TAG, "pdm read failed: dropped=%" PRIu32 " ret=%s",
                     s_dropped_frame_count, esp_err_to_name(ret));
            diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_I2S_FAIL, DIAG_SEV_WARN, s_dropped_frame_count, ret, 0, 0);
        }
        audio_capture_yield_if_over_budget(&scheduler_budget_started_us);
        vTaskDelay(pdMS_TO_TICKS(5));
    }
}

static esp_err_t audio_capture_i2s_init(void)
{
#if !SOC_I2S_SUPPORTS_PDM2PCM
    ESP_LOGE(TAG, "SPH0655 PDM microphone requires hardware PDM2PCM support");
    return ESP_ERR_NOT_SUPPORTED;
#else
    i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(BOARD_PINS_I2S_PORT, I2S_ROLE_MASTER);
    chan_cfg.auto_clear = true;
    ESP_RETURN_ON_ERROR(i2s_new_channel(&chan_cfg, NULL, &s_i2s_rx_handle), TAG, "create i2s channel failed");

    i2s_pdm_rx_config_t pdm_cfg = {
        .clk_cfg = I2S_PDM_RX_CLK_DEFAULT_CONFIG(AUDIO_CAPTURE_SAMPLE_RATE_HZ),
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
        .slot_cfg = I2S_PDM_RX_SLOT_PCM_FMT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_STEREO),
#else
        .slot_cfg = I2S_PDM_RX_SLOT_PCM_FMT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO),
#endif
        .gpio_cfg = {
            .clk = BOARD_PINS_MIC_CLK_IO,
            .din = BOARD_PINS_MIC_DOUT_IO,
            .invert_flags = {
                .clk_inv = AUDIO_CAPTURE_SPH0655_CLK_INVERT_ENABLED,
            },
        },
    };
    /* SPH0655 requires a PDM clock of at least 1.1 MHz. The IDF default 8S
     * setting would generate 1.024 MHz at 16 kHz PCM, below that range.
     * 16S keeps the 16 kHz output contract while driving the mic at 2.048 MHz. */
    pdm_cfg.clk_cfg.dn_sample_mode = I2S_PDM_DSR_16S;
#if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
    pdm_cfg.slot_cfg.slot_mask = I2S_PDM_SLOT_BOTH;
#endif
#if defined(SOC_I2S_SUPPORTS_PDM_RX_HP_FILTER) && SOC_I2S_SUPPORTS_PDM_RX_HP_FILTER
    pdm_cfg.slot_cfg.hp_en = true;
    pdm_cfg.slot_cfg.hp_cut_off_freq_hz = 35.5f;
    pdm_cfg.slot_cfg.amplify_num = AUDIO_CAPTURE_PDM_HW_AMPLIFY_NUM;
#endif

    ESP_RETURN_ON_ERROR(i2s_channel_init_pdm_rx_mode(s_i2s_rx_handle, &pdm_cfg), TAG, "init pdm rx failed");
    ESP_RETURN_ON_ERROR(i2s_channel_enable(s_i2s_rx_handle), TAG, "enable pdm rx failed");
    ESP_LOGI(
        TAG,
        "SPH0655 V2.2 PDM contract: select=GND data_edge=falling active_slot=%s clk_invert=%u pcm=%uHz pdm_clk=%uHz dsr=16S clk=%d din=%d hp_filter=%u hw_amplify=%u sw_gain_max=%u sw_gain_target_peak=%u",
 #if CONFIG_AUDIO_CAPTURE_PDM_STEREO_SLOT_CAPTURE
        s_pdm_selected_slot == 0 ? "left" : "right",
 #else
        "standard-mono",
 #endif
        (unsigned)AUDIO_CAPTURE_SPH0655_CLK_INVERT_ENABLED,
        AUDIO_CAPTURE_SAMPLE_RATE_HZ,
        AUDIO_CAPTURE_SAMPLE_RATE_HZ * 128U,
        (int)BOARD_PINS_MIC_CLK_IO,
        (int)BOARD_PINS_MIC_DOUT_IO,
#if defined(SOC_I2S_SUPPORTS_PDM_RX_HP_FILTER) && SOC_I2S_SUPPORTS_PDM_RX_HP_FILTER
        1u,
        AUDIO_CAPTURE_PDM_HW_AMPLIFY_NUM,
        (unsigned)AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_MAX_NUM,
        (unsigned)AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_TARGET_PEAK
#else
        0u,
        1u,
        (unsigned)AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_MAX_NUM,
        (unsigned)AUDIO_CAPTURE_PDM_SOFTWARE_GAIN_TARGET_PEAK
#endif
    );
    return ESP_OK;
#endif
}

