Listener-ai-Macau/Listener-Firmware/ports/esp32/audio_capture/audio_capture_esp32.c
#endif /* CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM */

/* ========== Public API ========== */

esp_err_t audio_capture_start(void)
{
    if (s_started) {
        return ESP_OK;
    }

    const char *unavailable_reason = audio_capture_static_unavailable_reason();
    if (unavailable_reason != NULL) {
        ESP_LOGW(TAG, "audio capture degraded: %s", unavailable_reason);
        diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_INIT_FAIL, DIAG_SEV_WARN, 8,
                 ESP_ERR_NOT_SUPPORTED, (uint32_t)BOARD_PINS_MIC_CLK_IO,
                 (uint32_t)BOARD_PINS_MIC_DOUT_IO);
        return ESP_ERR_NOT_SUPPORTED;
    }

    esp_err_t err = audio_capture_voice_preroll_init();
    if (err != ESP_OK) {
        diag_log(
            DIAG_SRC_AUDIO,
            DIAG_AUDIO_INIT_FAIL,
            DIAG_SEV_ERROR,
            10,
            err,
            AUDIO_CAPTURE_VOICE_PREROLL_BYTES,
            0);
        return err;
    }

    err = audio_capture_i2s_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "i2s start fail");
        diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_INIT_FAIL, DIAG_SEV_ERROR, 1, err, 0, 0);
        return err;
    }
    ESP_LOGI(TAG, "i2s start ok");

#ifdef CONFIG_AUDIO_CAPTURE_MIC_ES8311
    err = audio_capture_i2c_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "i2c init fail");
        diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_INIT_FAIL, DIAG_SEV_ERROR, 2, err, 0, 0);
        i2s_channel_disable(s_i2s_rx_handle);
        return err;
    }

    err = audio_capture_codec_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "codec init fail");
        diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_INIT_FAIL, DIAG_SEV_ERROR, 3, err, 0, 0);
        i2s_channel_disable(s_i2s_rx_handle);
        return err;
    }
    ESP_LOGI(TAG, "codec init ok");
#endif

    s_state_mutex = xSemaphoreCreateMutex();
    if (s_state_mutex == NULL) {
        ESP_LOGE(TAG, "state mutex create fail");
        i2s_channel_disable(s_i2s_rx_handle);
        return ESP_ERR_NO_MEM;
    }

    s_started = true;

#if defined(CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM) && CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
    err = audio_capture_pdm_afe_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "PDM AFE init fail: %s", esp_err_to_name(err));
        diag_log(DIAG_SRC_AUDIO, DIAG_AUDIO_INIT_FAIL, DIAG_SEV_ERROR, 9, err, 0, 0);
        i2s_channel_disable(s_i2s_rx_handle);
        vSemaphoreDelete(s_state_mutex);
        s_state_mutex = NULL;
        s_started = false;
        return err;
    }
#endif

    /* Capture is an I2S hot path and its task stack must stay internal. */
    BaseType_t capture_task_ok = xTaskCreatePinnedToCore(
        audio_capture_task,
        "audio_capture_task",
        AUDIO_CAPTURE_TASK_STACK_BYTES,
        NULL,
        5,
        &s_capture_task_handle,
        AUDIO_CAPTURE_TASK_CORE);
    if (capture_task_ok != pdPASS) {
        ESP_LOGE(
            TAG,
            "task create fail internal_free=%u",
            (unsigned)esp_get_free_internal_heap_size());
#if defined(CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM) && CONFIG_AUDIO_CAPTURE_PDM_AFE_WEBRTC
        /* Do not leave AFE/fetch half-initialized: that OOM cascade panics NimBLE. */
        if (s_pdm_afe_fetch_task_handle != NULL) {
            vTaskDelete(s_pdm_afe_fetch_task_handle);
            s_pdm_afe_fetch_task_handle = NULL;
        }
        if (s_pdm_agc_handle != NULL) {
            esp_agc_close(s_pdm_agc_handle);
            s_pdm_agc_handle = NULL;
        }
        free(s_pdm_afe_feed_buffer);
        free(s_pdm_afe_fetch_buffer);
        s_pdm_afe_feed_buffer = NULL;
        s_pdm_afe_fetch_buffer = NULL;
        if (s_pdm_afe_handle != NULL && s_pdm_afe_data != NULL) {
            s_pdm_afe_handle->destroy(s_pdm_afe_data);
        }
        s_pdm_afe_data = NULL;
        s_pdm_afe_handle = NULL;
#endif
        i2s_channel_disable(s_i2s_rx_handle);
        vSemaphoreDelete(s_state_mutex);
        s_state_mutex = NULL;
        s_started = false;
        return ESP_ERR_NO_MEM;
    }

#ifdef CONFIG_AUDIO_CAPTURE_MIC_SPH0655_PDM
    ESP_LOGI(TAG, "audio capture started: SPH0655 PDM digital mic");
#endif

    return ESP_OK;
}

bool audio_capture_is_available(void)
{
    return audio_capture_static_unavailable_reason() == NULL;
}

const char *audio_capture_get_unavailable_reason(void)
{
    return audio_capture_static_unavailable_reason();
}

uint32_t audio_capture_get_frame_count(void)
{
    return s_frame_count;
}

uint32_t audio_capture_get_dropped_frame_count(void)
{
    return s_dropped_frame_count;
}
